* Bridge ID

ecb5fafffe259801

* V1

{
  "config": {
    "UTC": "2022-12-08T18:53:37.726638185Z",
    "apiversion": "1.53.0",
    "backup": {
      "errorcode": 0,
      "status": []
    },
    "bridgeid": "9061aeFFFE218f6d",
    "datastoreversion": "131",
    "dhcp": true,
    "factorynew": false,
    "gateway": "192.168.1.1",
    "internetservices": {
      "internet": "connected",
      "remoteaccess": "connected",
      "swupdate": "disconnected",
      "time": "connected"
    },
    "ipaddress": "192.168.1.20",
    "linkbutton": false,
    "localtime": "2022-12-08T18:53:37.726638185Z",
    "mac": "9061ae218f6d",
    "modelid": "BSB002",
    "name": "MQTT2hue",
    "netmask": "255.255.255.0",
    "portalconnection": "disconnected",
    "portalservices": true,
    "portalstate": {
      "communication": "disconnected",
      "incoming": false,
      "outgoing": false,
      "signedon": false
    },
    "proxyaddress": "none",
    "proxyport": 0,
    "replacesbridgeid": null,
    "starterkitid": "",
    "swupdate": {
      "checkforupdate": false,
      "devicetypes": {
        "bridge": false,
        "lights": [],
        "sensors": []
      },
      "notify": true,
      "text": "",
      "updatestate": 0,
      "url": ""
    },
    "swupdate2": {
      "autoinstall": {
        "on": true,
        "updatetime": "03:00:00"
      },
      "bridge": {
        "lastinstall": "2022-12-08T18:53:37.726638185Z",
        "state": "noupdates"
      },
      "checkforupdate": false,
      "lastchange": "2022-12-08T18:53:37.726638185Z",
      "state": "noupdates"
    },
    "swversion": "1953188020",
    "timezone": "Europe/Stockholm",
    "whitelist": {
      "06c08762c10b39be19fffec7adac264c": {
        "create date": "2022-12-08T18:53:33.895836142Z",
        "last use date": "2022-12-08T18:53:37.72660608Z",
        "name": "Hue#moto x4"
      },
      "592f873489e9cbecad411792fa5f11a4": {
        "create date": "2022-12-08T17:48:18.912270864Z",
        "last use date": "2022-12-08T17:48:19.37118151Z",
        "name": "gnome-hue-lights#neptune"
      },
      "95c06e3b6820c27d6e98c7138bb917f0": {
        "create date": "2022-12-08T09:45:34.095257349Z",
        "last use date": "2022-12-08T18:40:17.523833274Z",
        "name": "all 4 hue#moto x4"
      }
    },
    "zigbeechannel": 15
  },
  "groups": {
    "1": {
      "action": {
        "alert": "select",
        "bri": 1,
        "colormode": "ct",
        "ct": 396,
        "effect": [],
        "mode": "homeautomation",
        "on": false,
        "reachable": true,
        "xy": [
          0.4752,
          0.4134
        ]
      },
      "class": "Living room",
      "lights": [
        "1"
      ],
      "name": "Living Room Upstairs",
      "recycle": false,
      "sensors": [],
      "state": {
        "all_on": false,
        "any_on": false
      },
      "type": "Room"
    }
  },
  "lights": {
    "1": {
      "capabilities": {
        "certified": false,
        "control": {
          "colorgamuttype": "other",
          "tag": "fullcolor"
        }
      },
      "config": {
        "archetype": "sultanbulb",
        "direction": "omnidirectional",
        "function": "functional",
        "startup": {
          "configured": true,
          "mode": "safety"
        }
      },
      "manufacturername": "Philips",
      "modelid": "Hue white and color ambiance LightStrip plus (8718699703424)",
      "name": "TV Backlight",
      "productname": "TV Backlight",
      "state": {
        "alert": "select",
        "bri": 1,
        "colormode": "ct",
        "ct": 396,
        "effect": [],
        "hue": 30,
        "mode": "homeautomation",
        "on": false,
        "reachable": true,
        "sat": 86,
        "xy": [
          0.4752,
          0.4134
        ]
      },
      "swupdate": {
        "lastinstall": "2022-12-08T18:53:37.72660608Z",
        "state": "noupdates"
      },
      "swversion": "1.93.11",
      "type": "Extended color light",
      "uniqueid": "0x001788010bf4769e_light_zigbee2mqtt"
    }
  },
  "resoucelinks": {},
  "rules": {},
  "scenes": {
    "1": {
      "group": "1",
      "lastupdated": "2022-12-08T18:53:37.72660608Z",
      "lights": [
        "1"
      ],
      "locked": true,
      "name": "Test Scene",
      "owner": "1",
      "picture": "",
      "recycle": true,
      "type": "GroupScene",
      "version": 2
    },
    "2": {
      "group": "1",
      "lastupdated": "2022-12-08T18:53:37.72660608Z",
      "lights": [
        "1"
      ],
      "locked": true,
      "name": "Evening",
      "owner": "1",
      "picture": "",
      "recycle": true,
      "type": "GroupScene",
      "version": 2
    }
  },
  "schedules": {},
  "sensors": {}
}

* V2

** Certificate verification

#+begin_src shell :results verbatim
curl --cacert "root-cert.pem" --resolve "ecb5fafffe259801:443:192.168.1.19" -H "hue-application-key: MOnR-DdEU4iuryG4BpiZhhB94uNovMMM4eK0ASHU" -X GET https://ecb5fafffe259801/clip/v2/resource
#+end_src

#+RESULTS[7dfcbb754ea610d0b867dc64956c27a07e2b3abd]:
: {"errors":[],"data":[{"id":"96b337f3-3d57-4887-869e-c23ce61011bb","status":"pairing","status_values":["pairing","paired","unpaired"],"type":"homekit"},{"id":"377ce42c-97f4-4501-8907-d46c4d25088e","id_v1":"/scenes/kO6gcWNv8qyzk80","metadata":{"name":"Relax","image":{"rid":"a1f7da49-d181-4328-abea-68c9dc4b5416","rtype":"public_image"}},"group":{"rid":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","rtype":"room"},"actions":[{"target":{"rid":"0b6a4fea-d6bf-4fdc-9d64-b0cce39aae1c","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":56.69},"color_temperature":{"mirek":447}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"f08131ff-1a48-4f1b-9e9e-b3323355484e","id_v1":"/scenes/HirhptNBipTNA17","metadata":{"name":"Nightlight","image":{"rid":"28bbfeff-1a0c-444e-bb4b-0b74b88e0c95","rtype":"public_image"}},"group":{"rid":"ddfd3d7c-4795-4774-be9c-9c67b194c5a1","rtype":"room"},"actions":[{"target":{"rid":"f496b912-8022-46db-a42d-4ca706f18fd1","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":0.39}}},{"target":{"rid":"f4869d00-b9e7-494d-8bfc-e58f9a432504","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":0.39}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"e6b54730-04a0-47b7-976c-6e67f9c0d6e0","id_v1":"/scenes/vECj3m-KEhLkGe0","metadata":{"name":"Spring blossom","image":{"rid":"adfa9c3e-e9aa-4b65-b9d3-c5b2c0576715","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":82.28},"color_temperature":{"mirek":250}}}],"palette":{"color":[{"color":{"xy":{"x":0.3517,"y":0.3154}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.359,"y":0.2925}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.3744,"y":0.2692}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.4435,"y":0.2537}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.514,"y":0.3338}},"dimming":{"brightness":81.1}}],"dimming":[{"brightness":81.1}],"color_temperature":[{"color_temperature":{"mirek":198},"dimming":{"brightness":81.1}}]},"speed":0.5595238095238095,"auto_dynamic":false,"type":"scene"},{"id":"91086d46-be1f-4c29-ae60-1dc0cca2f9ef","id_v1":"/scenes/Jq802pc6F91zXwS","metadata":{"name":"Dimmed","image":{"rid":"8c74b9ba-6e89-4083-a2a7-b10a1e566fed","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":30.31},"color_temperature":{"mirek":367}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"ab77c76a-945f-4ac8-9664-bb0346e9e367","id_v1":"/scenes/gzrbIK8WUSNUbPt","metadata":{"name":"Nightlight","image":{"rid":"28bbfeff-1a0c-444e-bb4b-0b74b88e0c95","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":0.39},"color_temperature":{"mirek":447}}}],"palette":{"color":[{"color":{"xy":{"x":0.561,"y":0.4042}},"dimming":{"brightness":0.0}}],"dimming":[],"color_temperature":[{"color_temperature":{"mirek":447},"dimming":{"brightness":0.39}}]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"456485ab-c765-4dc6-9f7b-8a78b5c6150b","id_v1":"/scenes/4fga1HKg8GYtBF2","metadata":{"name":"Relax","image":{"rid":"a1f7da49-d181-4328-abea-68c9dc4b5416","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":56.69},"color_temperature":{"mirek":447}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"deeb23ef-6dfc-4aff-a1ab-b22f54c843e1","id_v1":"/scenes/ZxXG41ZtblzHAV8","metadata":{"name":"Concentrate","image":{"rid":"b90c8900-a6b7-422c-a5d3-e170187dbf8c","rtype":"public_image"}},"group":{"rid":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","rtype":"room"},"actions":[{"target":{"rid":"0b6a4fea-d6bf-4fdc-9d64-b0cce39aae1c","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":233}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"23186b38-a998-4632-8b1d-7272c9499b39","id_v1":"/scenes/euhL3QqqjPAlV6J","metadata":{"name":"Sunrise  🌅"},"group":{"rid":"581d7d2d-8cdc-4462-99d4-79182f44b63a","rtype":"room"},"actions":[{"target":{"rid":"640686ce-9fb6-47fb-8b81-49b2562f12f8","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":29.92},"color_temperature":{"mirek":153}}},{"target":{"rid":"3607afa7-bd81-4fb6-a694-38231fb912c5","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":61.42},"color":{"xy":{"x":0.5442,"y":0.419}}}}],"palette":{"color":[{"color":{"xy":{"x":0.5442,"y":0.419}},"dimming":{"brightness":61.42}}],"dimming":[],"color_temperature":[{"color_temperature":{"mirek":153},"dimming":{"brightness":48.43}}]},"speed":0.6031746031746031,"auto_dynamic":false,"type":"scene"},{"id":"15424787-7d8c-4166-bf28-5182270bc281","id_v1":"/scenes/fLnMh9aBXenXsEM","metadata":{"name":"Relax","image":{"rid":"a1f7da49-d181-4328-abea-68c9dc4b5416","rtype":"public_image"}},"group":{"rid":"9b7589fa-b68c-4b39-a837-3f0c0ccce73a","rtype":"room"},"actions":[{"target":{"rid":"18153cfe-8bdc-4ec1-b866-a761c2eff249","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":56.3},"color_temperature":{"mirek":447}}},{"target":{"rid":"8630af91-e448-4b34-ac3a-aeadf96d65cf","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":56.3},"color_temperature":{"mirek":447}}},{"target":{"rid":"0bc36433-732a-4147-b535-996e84f6581d","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":56.3},"color_temperature":{"mirek":447}}},{"target":{"rid":"d31255fd-9b4b-4aa9-9024-95cd7ef5a24a","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":56.3}}}],"palette":{"color":[],"dimming":[{"brightness":56.3}],"color_temperature":[{"color_temperature":{"mirek":447},"dimming":{"brightness":56.3}}]},"speed":0.6031746031746031,"auto_dynamic":false,"type":"scene"},{"id":"ef2982d6-693d-446a-8ce8-acdcab34c67c","id_v1":"/scenes/pFkkGFXLsrxkWd6","metadata":{"name":"Savanna sunset","image":{"rid":"4f2ed241-5aea-4c9d-8028-55d2b111e06f","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":92.91},"color_temperature":{"mirek":387}}}],"palette":{"color":[{"color":{"xy":{"x":0.6563,"y":0.3211}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.5862,"y":0.3575}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.5502,"y":0.3655}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.4577,"y":0.4563}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.4162,"y":0.4341}},"dimming":{"brightness":80.71}}],"dimming":[{"brightness":80.71}],"color_temperature":[{"color_temperature":{"mirek":373},"dimming":{"brightness":80.71}}]},"speed":0.6190476190476191,"auto_dynamic":false,"type":"scene"},{"id":"2ac575ec-01e7-40be-bb7e-208df420c1c1","id_v1":"/scenes/Mq3ypjV26vhV1ib","metadata":{"name":"Relax","image":{"rid":"a1f7da49-d181-4328-abea-68c9dc4b5416","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":56.69},"color_temperature":{"mirek":447}}}],"palette":{"color":[],"dimming":[],"color_temperature":[{"color_temperature":{"mirek":447},"dimming":{"brightness":56.69}}]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"f543e6a8-f09d-4719-bb6a-4bfbaff82dd7","id_v1":"/scenes/hXEjB9vKwdKTNyL","metadata":{"name":"Read","image":{"rid":"e101a77f-9984-4f61-aac8-15741983c656","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":346}}}],"palette":{"color":[],"dimming":[],"color_temperature":[{"color_temperature":{"mirek":346},"dimming":{"brightness":100.0}}]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"e0119eb4-aa91-4b76-aae4-efa654e1605e","id_v1":"/scenes/tMZyITsfIzULPnR","metadata":{"name":"Day"},"group":{"rid":"581d7d2d-8cdc-4462-99d4-79182f44b63a","rtype":"room"},"actions":[{"target":{"rid":"640686ce-9fb6-47fb-8b81-49b2562f12f8","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":25.98},"color_temperature":{"mirek":298}}},{"target":{"rid":"3607afa7-bd81-4fb6-a694-38231fb912c5","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":60.24},"color_temperature":{"mirek":193}}}],"palette":{"color":[],"dimming":[],"color_temperature":[{"color_temperature":{"mirek":298},"dimming":{"brightness":25.98}}]},"speed":0.6031746031746031,"auto_dynamic":false,"type":"scene"},{"id":"43be2493-5b30-4932-8fb5-7150f60aba3d","id_v1":"/scenes/BkPFerdCjoxyDFS","metadata":{"name":"Concentrate","image":{"rid":"b90c8900-a6b7-422c-a5d3-e170187dbf8c","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":233}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"bc9bd86d-b5f6-4285-812c-bde48cc9195b","id_v1":"/scenes/adYzlGM8G7W5HET","metadata":{"name":"Bright","image":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"public_image"}},"group":{"rid":"ddfd3d7c-4795-4774-be9c-9c67b194c5a1","rtype":"room"},"actions":[{"target":{"rid":"f496b912-8022-46db-a42d-4ca706f18fd1","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0}}},{"target":{"rid":"f4869d00-b9e7-494d-8bfc-e58f9a432504","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"fc736cbb-fd7d-4c85-afb8-e6677322e752","id_v1":"/scenes/WjpOM1YxWJA54x6","metadata":{"name":"Nightlight","image":{"rid":"28bbfeff-1a0c-444e-bb4b-0b74b88e0c95","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":0.39},"color_temperature":{"mirek":447}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"741e2788-bfd4-4daa-a651-d6fc67e60717","id_v1":"/scenes/mWBG2q6mNpHAbGy","metadata":{"name":"Bright","image":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"public_image"}},"group":{"rid":"e9d97c83-2488-4c58-8ccc-113e4423f199","rtype":"room"},"actions":[{"target":{"rid":"ac483b54-be97-4178-ba14-85a926940835","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"6f2bb98f-0481-4c15-8887-fe45f34edbfc","id_v1":"/scenes/pfo8JWkvYnOJDsL","metadata":{"name":"Concentrate","image":{"rid":"b90c8900-a6b7-422c-a5d3-e170187dbf8c","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":250}}}],"palette":{"color":[],"dimming":[],"color_temperature":[{"color_temperature":{"mirek":250},"dimming":{"brightness":100.0}}]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"f23f87fb-c870-42fd-92b6-9a256c12ced4","id_v1":"/scenes/ULEZXDnazIri6rC","metadata":{"name":"Tropical twilight","image":{"rid":"a6a03e6a-fe6e-45bc-b686-878137f3ba91","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":73.23},"color_temperature":{"mirek":322}}}],"palette":{"color":[{"color":{"xy":{"x":0.5802,"y":0.3952}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.5632,"y":0.3841}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.4563,"y":0.3607}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.3632,"y":0.2877}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.294,"y":0.223}},"dimming":{"brightness":43.7}}],"dimming":[{"brightness":43.7}],"color_temperature":[{"color_temperature":{"mirek":306},"dimming":{"brightness":43.7}}]},"speed":0.6388888888888888,"auto_dynamic":false,"type":"scene"},{"id":"8275ec25-f961-4399-b2bb-dcb15014e270","id_v1":"/scenes/p74dYwuEFAqP6uG","metadata":{"name":"Tropical twilight","image":{"rid":"a6a03e6a-fe6e-45bc-b686-878137f3ba91","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":73.23},"color_temperature":{"mirek":322}}}],"palette":{"color":[{"color":{"xy":{"x":0.5802,"y":0.3952}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.5632,"y":0.3841}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.4563,"y":0.3607}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.3632,"y":0.2877}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.294,"y":0.223}},"dimming":{"brightness":43.7}}],"dimming":[{"brightness":43.7}],"color_temperature":[{"color_temperature":{"mirek":306},"dimming":{"brightness":43.7}}]},"speed":0.6388888888888888,"auto_dynamic":false,"type":"scene"},{"id":"f259c116-69b6-4025-b449-3a1d80992a95","id_v1":"/scenes/08w--9lgfTS4x5O","metadata":{"name":"Relax","image":{"rid":"a1f7da49-d181-4328-abea-68c9dc4b5416","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":56.69},"color_temperature":{"mirek":447}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"5720f782-444c-4b58-a6b5-0888c7b316f6","id_v1":"/scenes/TwaJxfH2zKWGlrQ","metadata":{"name":"Read","image":{"rid":"e101a77f-9984-4f61-aac8-15741983c656","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":346}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"17eab403-d58c-4a3e-9c77-9a98361d7bde","id_v1":"/scenes/Ihc651Du7MfA2Xz","metadata":{"name":"Bright","image":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"public_image"}},"group":{"rid":"5275317f-dc25-4a07-a35e-3ff349de557d","rtype":"room"},"actions":[{"target":{"rid":"bca61a7f-0471-4ac0-9500-0a43d291179a","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color":{"xy":{"x":0.4584,"y":0.41}},"color_temperature":{"mirek":366}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"ecc278fc-87ea-44e1-93ae-b6f8bb2d9712","id_v1":"/scenes/tMLW1z-hoEZphTH","metadata":{"name":"Read","image":{"rid":"e101a77f-9984-4f61-aac8-15741983c656","rtype":"public_image"}},"group":{"rid":"581d7d2d-8cdc-4462-99d4-79182f44b63a","rtype":"room"},"actions":[{"target":{"rid":"640686ce-9fb6-47fb-8b81-49b2562f12f8","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":367}}},{"target":{"rid":"3607afa7-bd81-4fb6-a694-38231fb912c5","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":367}}}],"palette":{"color":[],"dimming":[],"color_temperature":[{"color_temperature":{"mirek":367},"dimming":{"brightness":100.0}}]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"d98ae2ca-3c1c-4485-928a-837c9d98daaa","id_v1":"/scenes/WZ1U6rXAAZ9IJxM","metadata":{"name":"Energize","image":{"rid":"7fd2ccc5-5749-4142-b7a5-66405a676f03","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":156}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"ed4aafca-5c06-4eda-882a-01feae5db435","id_v1":"/scenes/N-BFC6SBBosLGxi","metadata":{"name":"Dimmed","image":{"rid":"8c74b9ba-6e89-4083-a2a7-b10a1e566fed","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":30.31},"color_temperature":{"mirek":367}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"3940435e-1a3f-4cc8-aeae-d943841935b8","id_v1":"/scenes/X0vwO2ics-yQUSg","metadata":{"name":"Energize","image":{"rid":"7fd2ccc5-5749-4142-b7a5-66405a676f03","rtype":"public_image"}},"group":{"rid":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","rtype":"room"},"actions":[{"target":{"rid":"0b6a4fea-d6bf-4fdc-9d64-b0cce39aae1c","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":200}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"3061dc7a-418f-4c3f-a044-6974722df9f4","id_v1":"/scenes/yHrWc3l5Pu7lyOJ","metadata":{"name":"Dimmed","image":{"rid":"8c74b9ba-6e89-4083-a2a7-b10a1e566fed","rtype":"public_image"}},"group":{"rid":"5275317f-dc25-4a07-a35e-3ff349de557d","rtype":"room"},"actions":[{"target":{"rid":"bca61a7f-0471-4ac0-9500-0a43d291179a","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":30.31},"color":{"xy":{"x":0.4584,"y":0.41}},"color_temperature":{"mirek":366}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"42b18f46-b30a-4f50-88d2-ad5e1f636342","id_v1":"/scenes/u0ixqXlIldzDGE2","metadata":{"name":"Bright","image":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":367}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"d8874ed8-9ff3-44b9-8603-566cdd52d42e","id_v1":"/scenes/vYftrtaYxxChEQq","metadata":{"name":"Arctic aurora","image":{"rid":"1e42b2e8-d02e-40d2-9c8d-b1fd8216c686","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":58.66},"color_temperature":{"mirek":153}}}],"palette":{"color":[{"color":{"xy":{"x":0.2439,"y":0.3791}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.1654,"y":0.3959}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.1829,"y":0.3021}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.1559,"y":0.2699}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.2004,"y":0.2469}},"dimming":{"brightness":30.71}}],"dimming":[{"brightness":30.71}],"color_temperature":[{"color_temperature":{"mirek":154},"dimming":{"brightness":30.71}}]},"speed":0.6388888888888888,"auto_dynamic":false,"type":"scene"},{"id":"1913dcd2-f4cf-4fc7-80a1-f0b99ca02dd3","id_v1":"/scenes/lL57JoaTDAWShME","metadata":{"name":"Savanna sunset","image":{"rid":"4f2ed241-5aea-4c9d-8028-55d2b111e06f","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":92.91},"color_temperature":{"mirek":387}}}],"palette":{"color":[{"color":{"xy":{"x":0.6563,"y":0.3211}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.5862,"y":0.3575}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.5502,"y":0.3655}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.4577,"y":0.4563}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.4162,"y":0.4341}},"dimming":{"brightness":80.71}}],"dimming":[{"brightness":80.71}],"color_temperature":[{"color_temperature":{"mirek":373},"dimming":{"brightness":80.71}}]},"speed":0.6190476190476191,"auto_dynamic":false,"type":"scene"},{"id":"4d975c18-565f-48f5-a5ea-eba791e0a494","id_v1":"/scenes/PKf2hIX5YrFCgIX","metadata":{"name":"Nightlight","image":{"rid":"28bbfeff-1a0c-444e-bb4b-0b74b88e0c95","rtype":"public_image"}},"group":{"rid":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","rtype":"room"},"actions":[{"target":{"rid":"0b6a4fea-d6bf-4fdc-9d64-b0cce39aae1c","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":0.39},"color_temperature":{"mirek":454}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"0bd034ad-6887-41ff-a390-7bcacd7a1aa8","id_v1":"/scenes/tPmsVkzEb2b41lH","metadata":{"name":"Concentrate","image":{"rid":"b90c8900-a6b7-422c-a5d3-e170187dbf8c","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":233}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"a7a8579b-4417-4ffc-9a34-6cfeaafd85ae","id_v1":"/scenes/6Xnael8yCGorZ7n","metadata":{"name":"Dimmed","image":{"rid":"8c74b9ba-6e89-4083-a2a7-b10a1e566fed","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":30.31},"color_temperature":{"mirek":367}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"b157e96d-2a2e-4cbe-84c6-aa11a0c1d3e6","id_v1":"/scenes/-boE4lHcVhIFSmN","metadata":{"name":"Bright","image":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"public_image"}},"group":{"rid":"e4b0ca1d-d9a5-4a92-9ace-1eca930af209","rtype":"room"},"actions":[{"target":{"rid":"7a13fe24-5c01-4e07-b076-4ac8ab0fe406","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":366}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"99821a6e-ea97-4ea7-8521-e244c18bfcf3","id_v1":"/scenes/9oaLrol6-PO6PBQ","metadata":{"name":"Arctic aurora","image":{"rid":"1e42b2e8-d02e-40d2-9c8d-b1fd8216c686","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":58.66},"color_temperature":{"mirek":153}}}],"palette":{"color":[{"color":{"xy":{"x":0.2439,"y":0.3791}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.1654,"y":0.3959}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.1829,"y":0.3021}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.1559,"y":0.2699}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.2004,"y":0.2469}},"dimming":{"brightness":30.71}}],"dimming":[{"brightness":30.71}],"color_temperature":[{"color_temperature":{"mirek":154},"dimming":{"brightness":30.71}}]},"speed":0.6388888888888888,"auto_dynamic":false,"type":"scene"},{"id":"062d7f38-765d-43ad-87f6-d3039fa2a736","id_v1":"/scenes/z3kn-CDJ4aFtckT","metadata":{"name":"Dimmed","image":{"rid":"8c74b9ba-6e89-4083-a2a7-b10a1e566fed","rtype":"public_image"}},"group":{"rid":"e9d97c83-2488-4c58-8ccc-113e4423f199","rtype":"room"},"actions":[{"target":{"rid":"ac483b54-be97-4178-ba14-85a926940835","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":30.31}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"595177db-467e-4c86-ab57-f90f993101d7","id_v1":"/scenes/sLcb1f7tQFM08yR","metadata":{"name":"Spring blossom","image":{"rid":"adfa9c3e-e9aa-4b65-b9d3-c5b2c0576715","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":82.28},"color_temperature":{"mirek":215}}}],"palette":{"color":[{"color":{"xy":{"x":0.3517,"y":0.3154}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.359,"y":0.2925}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.3744,"y":0.2692}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.4435,"y":0.2537}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.514,"y":0.3338}},"dimming":{"brightness":81.1}}],"dimming":[{"brightness":81.1}],"color_temperature":[{"color_temperature":{"mirek":198},"dimming":{"brightness":81.1}}]},"speed":0.5595238095238095,"auto_dynamic":false,"type":"scene"},{"id":"9ba08d1a-45e6-4f24-8dec-70c3a54503a9","id_v1":"/scenes/GIgCh6xd5U125nE","metadata":{"name":"Dimmed","image":{"rid":"8c74b9ba-6e89-4083-a2a7-b10a1e566fed","rtype":"public_image"}},"group":{"rid":"ddfd3d7c-4795-4774-be9c-9c67b194c5a1","rtype":"room"},"actions":[{"target":{"rid":"f496b912-8022-46db-a42d-4ca706f18fd1","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":30.31}}},{"target":{"rid":"f4869d00-b9e7-494d-8bfc-e58f9a432504","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":30.31}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"108c23e0-5e20-4e6c-a094-1490776be8b4","id_v1":"/scenes/5J1ZzkKEUUvHePm","metadata":{"name":"Energize","image":{"rid":"7fd2ccc5-5749-4142-b7a5-66405a676f03","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":250}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"d6fdf87e-1478-4c94-bc92-df212a1ca45a","id_v1":"/scenes/Jn6Lguyk3pgXjUS","metadata":{"name":"Savanna sunset","image":{"rid":"4f2ed241-5aea-4c9d-8028-55d2b111e06f","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":92.91},"color_temperature":{"mirek":387}}}],"palette":{"color":[{"color":{"xy":{"x":0.6563,"y":0.3211}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.5862,"y":0.3575}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.5502,"y":0.3655}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.4577,"y":0.4563}},"dimming":{"brightness":80.71}},{"color":{"xy":{"x":0.4162,"y":0.4341}},"dimming":{"brightness":80.71}}],"dimming":[{"brightness":80.71}],"color_temperature":[{"color_temperature":{"mirek":373},"dimming":{"brightness":80.71}}]},"speed":0.6190476190476191,"auto_dynamic":false,"type":"scene"},{"id":"cc7a3d09-34b6-48f0-940f-cfcc75bd235a","id_v1":"/scenes/oPH2c6rZepJLvoA","metadata":{"name":"Energize","image":{"rid":"7fd2ccc5-5749-4142-b7a5-66405a676f03","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":156}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"e28b98ea-4f28-4ed3-9359-77d4e736f5d1","id_v1":"/scenes/oq8IMcG4QAb1T4P","metadata":{"name":"Bright","image":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":367}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"784a0b3d-95cc-40f5-ae46-58e69f3f2062","id_v1":"/scenes/YCpvh3LOi-23qLn","metadata":{"name":"Read","image":{"rid":"e101a77f-9984-4f61-aac8-15741983c656","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":346}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"01b0f456-ad47-40fc-96c3-5a08b4418a66","id_v1":"/scenes/BmNEUT5ImroR7hj","metadata":{"name":"Nightlight","image":{"rid":"28bbfeff-1a0c-444e-bb4b-0b74b88e0c95","rtype":"public_image"}},"group":{"rid":"581d7d2d-8cdc-4462-99d4-79182f44b63a","rtype":"room"},"actions":[{"target":{"rid":"640686ce-9fb6-47fb-8b81-49b2562f12f8","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":9.06},"color_temperature":{"mirek":500}}},{"target":{"rid":"3607afa7-bd81-4fb6-a694-38231fb912c5","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":7.87},"color":{"xy":{"x":0.1826,"y":0.0697}}}}],"palette":{"color":[{"color":{"xy":{"x":0.561,"y":0.4042}},"dimming":{"brightness":0.0}}],"dimming":[],"color_temperature":[{"color_temperature":{"mirek":367},"dimming":{"brightness":100.0}}]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"1561e74d-79f1-4378-88ff-c2faaa1221a8","id_v1":"/scenes/6EsdT73E6116jM2","metadata":{"name":"Read","image":{"rid":"e101a77f-9984-4f61-aac8-15741983c656","rtype":"public_image"}},"group":{"rid":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","rtype":"room"},"actions":[{"target":{"rid":"0b6a4fea-d6bf-4fdc-9d64-b0cce39aae1c","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":346}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"a89c8f05-2bef-44ee-b789-e08324eed59b","id_v1":"/scenes/5PZfyVUvMgT8K6Q","metadata":{"name":"Nightlight","image":{"rid":"28bbfeff-1a0c-444e-bb4b-0b74b88e0c95","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":0.39},"color_temperature":{"mirek":447}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"800dd17c-643a-4dd4-91d2-d3fb160de052","id_v1":"/scenes/GgrA1vRl069aseQ","metadata":{"name":"Tropical twilight","image":{"rid":"a6a03e6a-fe6e-45bc-b686-878137f3ba91","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":73.23},"color_temperature":{"mirek":322}}}],"palette":{"color":[{"color":{"xy":{"x":0.5802,"y":0.3952}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.5632,"y":0.3841}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.4563,"y":0.3607}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.3632,"y":0.2877}},"dimming":{"brightness":43.7}},{"color":{"xy":{"x":0.294,"y":0.223}},"dimming":{"brightness":43.7}}],"dimming":[{"brightness":43.7}],"color_temperature":[{"color_temperature":{"mirek":306},"dimming":{"brightness":43.7}}]},"speed":0.6388888888888888,"auto_dynamic":false,"type":"scene"},{"id":"18bd5bde-d35e-4d92-b4d5-06c42a2b4f25","id_v1":"/scenes/QyDk2W8nrBaX3xD","metadata":{"name":"Dimmed","image":{"rid":"8c74b9ba-6e89-4083-a2a7-b10a1e566fed","rtype":"public_image"}},"group":{"rid":"e4b0ca1d-d9a5-4a92-9ace-1eca930af209","rtype":"room"},"actions":[{"target":{"rid":"7a13fe24-5c01-4e07-b076-4ac8ab0fe406","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":30.31},"color_temperature":{"mirek":366}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"4ff1d846-5a53-436c-ae69-42a967bb6567","id_v1":"/scenes/WFUx6ORRjKJl5DX","metadata":{"name":"Nightlight","image":{"rid":"28bbfeff-1a0c-444e-bb4b-0b74b88e0c95","rtype":"public_image"}},"group":{"rid":"e9d97c83-2488-4c58-8ccc-113e4423f199","rtype":"room"},"actions":[{"target":{"rid":"ac483b54-be97-4178-ba14-85a926940835","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":0.39}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"8fe50f18-6a20-4a4d-ae47-fa1e6240ca46","id_v1":"/scenes/e4Pa-3BoruIxJEy","metadata":{"name":"Bright","image":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"public_image"}},"group":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"actions":[{"target":{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":100.0},"color_temperature":{"mirek":367}}}],"palette":{"color":[],"dimming":[],"color_temperature":[]},"speed":0.5,"auto_dynamic":false,"type":"scene"},{"id":"b8eb6891-57a3-405f-b8a1-1a78654ced21","id_v1":"/scenes/ZeuVl-mzpO1Sv-b","metadata":{"name":"Spring blossom","image":{"rid":"adfa9c3e-e9aa-4b65-b9d3-c5b2c0576715","rtype":"public_image"}},"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"actions":[{"target":{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":82.28},"color_temperature":{"mirek":215}}}],"palette":{"color":[{"color":{"xy":{"x":0.3517,"y":0.3154}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.359,"y":0.2925}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.3744,"y":0.2692}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.4435,"y":0.2537}},"dimming":{"brightness":81.1}},{"color":{"xy":{"x":0.514,"y":0.3338}},"dimming":{"brightness":81.1}}],"dimming":[{"brightness":81.1}],"color_temperature":[{"color_temperature":{"mirek":198},"dimming":{"brightness":81.1}}]},"speed":0.5595238095238095,"auto_dynamic":false,"type":"scene"},{"id":"6a0eba82-0708-4545-83d4-469d90f9112c","id_v1":"/scenes/BcW9t7oVrHVQL-u","metadata":{"name":"Arctic aurora","image":{"rid":"1e42b2e8-d02e-40d2-9c8d-b1fd8216c686","rtype":"public_image"}},"group":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"actions":[{"target":{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},"action":{"on":{"on":true},"dimming":{"brightness":58.66},"color_temperature":{"mirek":250}}}],"palette":{"color":[{"color":{"xy":{"x":0.2439,"y":0.3791}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.1654,"y":0.3959}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.1829,"y":0.3021}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.1559,"y":0.2699}},"dimming":{"brightness":30.71}},{"color":{"xy":{"x":0.2004,"y":0.2469}},"dimming":{"brightness":30.71}}],"dimming":[{"brightness":30.71}],"color_temperature":[{"color_temperature":{"mirek":154},"dimming":{"brightness":30.71}}]},"speed":0.6388888888888888,"auto_dynamic":false,"type":"scene"},{"id":"5275317f-dc25-4a07-a35e-3ff349de557d","id_v1":"/groups/7","children":[{"rid":"6cc8c1fc-13d0-4f26-aafb-e2f8939fcd6a","rtype":"device"}],"services":[{"rid":"ac93e5d9-930a-43d9-97ab-fdfdc692ba99","rtype":"grouped_light"}],"metadata":{"name":"Wardrobe downstairs","archetype":"hallway"},"type":"room"},{"id":"581d7d2d-8cdc-4462-99d4-79182f44b63a","id_v1":"/groups/1","children":[{"rid":"01409ea5-3435-4be6-9698-469021626b26","rtype":"device"},{"rid":"b372bc87-6fe5-4b1d-a2c7-294628874dd0","rtype":"device"}],"services":[{"rid":"1c99d52a-b4e6-44ff-9331-61cfcbd678eb","rtype":"grouped_light"}],"metadata":{"name":"JP office","archetype":"office"},"type":"room"},{"id":"e9d97c83-2488-4c58-8ccc-113e4423f199","id_v1":"/groups/11","children":[{"rid":"2cebd321-c0dd-46a2-8dd5-a8599ff20ea6","rtype":"device"}],"services":[{"rid":"5b5276f0-1de2-4138-b37f-ed5bd86659ca","rtype":"grouped_light"}],"metadata":{"name":"Master Bedroom","archetype":"bedroom"},"type":"room"},{"id":"53a67a3f-96c9-4af6-97a2-0c9bb968f9e7","id_v1":"/groups/13","children":[],"services":[],"metadata":{"name":"Attic","archetype":"attic"},"type":"room"},{"id":"8c934c0d-02e9-4e98-ad85-b9dd10542034","id_v1":"/groups/2","children":[{"rid":"de165f27-c5c2-4cb6-991d-9f484634597c","rtype":"device"}],"services":[{"rid":"4507b016-d8e3-4265-84af-df33a7d444a9","rtype":"grouped_light"}],"metadata":{"name":"Miranda","archetype":"bedroom"},"type":"room"},{"id":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","id_v1":"/groups/5","children":[{"rid":"d9521271-04cd-4663-834e-4297e40da723","rtype":"device"}],"services":[{"rid":"5d49a179-14c5-4071-ba4a-e468dc133722","rtype":"grouped_light"}],"metadata":{"name":"Irmeli","archetype":"bedroom"},"type":"room"},{"id":"9b7589fa-b68c-4b39-a837-3f0c0ccce73a","id_v1":"/groups/8","children":[{"rid":"208713e7-e7fb-49a8-b245-3c38757cbb65","rtype":"device"},{"rid":"cb263a90-dcdb-401d-8c55-e635a5750271","rtype":"device"},{"rid":"67fb62ca-d9ab-4b1b-bb4c-c7e0fc473f83","rtype":"device"},{"rid":"75be1128-6d2e-4c46-bf85-ded7f96bb88b","rtype":"device"}],"services":[{"rid":"b30d071a-505e-4e26-8166-258d8c55a556","rtype":"grouped_light"}],"metadata":{"name":"Living room upstairs","archetype":"bedroom"},"type":"room"},{"id":"ddfd3d7c-4795-4774-be9c-9c67b194c5a1","id_v1":"/groups/6","children":[{"rid":"44c6f948-f01b-4d8f-8184-06646c9a49c7","rtype":"device"},{"rid":"68b79717-5775-4424-820e-9db70658de9f","rtype":"device"}],"services":[{"rid":"8ce82796-e834-4538-9417-042dff949156","rtype":"grouped_light"}],"metadata":{"name":"Living room downstairs","archetype":"living_room"},"type":"room"},{"id":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","id_v1":"/groups/9","children":[{"rid":"9edae97f-fec9-4b6a-86aa-35d7733c56b4","rtype":"device"}],"services":[{"rid":"c2b42ff1-9e26-4ca1-9891-648dec038994","rtype":"grouped_light"}],"metadata":{"name":"Kitchen","archetype":"kitchen"},"type":"room"},{"id":"32bc3a88-083a-41b8-bf12-84a7409143b2","id_v1":"/groups/4","children":[{"rid":"e7992ab7-7a4c-4ef7-b811-b71300b7c7c2","rtype":"device"}],"services":[{"rid":"1e6ea6f3-6864-4ea8-a60e-fa4c3f9c1e6c","rtype":"grouped_light"}],"metadata":{"name":"Workshop","archetype":"garage"},"type":"room"},{"id":"e4b0ca1d-d9a5-4a92-9ace-1eca930af209","id_v1":"/groups/10","children":[{"rid":"60e74cfe-d480-457b-8994-4f3a4f5d230e","rtype":"device"}],"services":[{"rid":"4cd57ba4-35d9-4404-b607-f7c2704f54a0","rtype":"grouped_light"}],"metadata":{"name":"Garage","archetype":"garage"},"type":"room"},{"id":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","id_v1":"/groups/3","children":[{"rid":"ddf4472a-5ff0-47fe-8c0b-a34538afab7e","rtype":"device"}],"services":[{"rid":"f73b0c74-f13b-4e2c-99ea-6a6992441383","rtype":"grouped_light"}],"metadata":{"name":"Ann office","archetype":"office"},"type":"room"},{"id":"ac93e5d9-930a-43d9-97ab-fdfdc692ba99","id_v1":"/groups/7","owner":{"rid":"5275317f-dc25-4a07-a35e-3ff349de557d","rtype":"room"},"on":{"on":true},"dimming":{"brightness":100.0},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"color":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"1c99d52a-b4e6-44ff-9331-61cfcbd678eb","id_v1":"/groups/1","owner":{"rid":"581d7d2d-8cdc-4462-99d4-79182f44b63a","rtype":"room"},"on":{"on":true},"dimming":{"brightness":42.72},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"color":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"5b5276f0-1de2-4138-b37f-ed5bd86659ca","id_v1":"/groups/11","owner":{"rid":"e9d97c83-2488-4c58-8ccc-113e4423f199","rtype":"room"},"on":{"on":true},"dimming":{"brightness":100.0},"dimming_delta":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"4507b016-d8e3-4265-84af-df33a7d444a9","id_v1":"/groups/2","owner":{"rid":"8c934c0d-02e9-4e98-ad85-b9dd10542034","rtype":"room"},"on":{"on":true},"dimming":{"brightness":100.0},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"5d49a179-14c5-4071-ba4a-e468dc133722","id_v1":"/groups/5","owner":{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},"on":{"on":true},"dimming":{"brightness":100.0},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"b30d071a-505e-4e26-8166-258d8c55a556","id_v1":"/groups/8","owner":{"rid":"9b7589fa-b68c-4b39-a837-3f0c0ccce73a","rtype":"room"},"on":{"on":true},"dimming":{"brightness":37.4},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"8ce82796-e834-4538-9417-042dff949156","id_v1":"/groups/6","owner":{"rid":"ddfd3d7c-4795-4774-be9c-9c67b194c5a1","rtype":"room"},"on":{"on":false},"dimming":{"brightness":0.0},"dimming_delta":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"c2b42ff1-9e26-4ca1-9891-648dec038994","id_v1":"/groups/9","owner":{"rid":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","rtype":"room"},"on":{"on":false},"dimming":{"brightness":0.0},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"1e6ea6f3-6864-4ea8-a60e-fa4c3f9c1e6c","id_v1":"/groups/4","owner":{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},"on":{"on":false},"dimming":{"brightness":0.0},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"656089a4-df66-4415-9e73-ad0c4d4f82a5","id_v1":"/groups/0","owner":{"rid":"07bfb801-8250-4a40-8878-9d7d09ad0eed","rtype":"bridge_home"},"on":{"on":true},"dimming":{"brightness":72.51},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"color":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"4cd57ba4-35d9-4404-b607-f7c2704f54a0","id_v1":"/groups/10","owner":{"rid":"e4b0ca1d-d9a5-4a92-9ace-1eca930af209","rtype":"room"},"on":{"on":true},"dimming":{"brightness":100.0},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"f73b0c74-f13b-4e2c-99ea-6a6992441383","id_v1":"/groups/3","owner":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"on":{"on":true},"dimming":{"brightness":100.0},"dimming_delta":{},"color_temperature":{},"color_temperature_delta":{},"alert":{"action_values":["breathe"]},"signaling":{},"dynamics":{},"type":"grouped_light"},{"id":"9edae97f-fec9-4b6a-86aa-35d7733c56b4","id_v1":"/lights/12","product_data":{"model_id":"RB 278 T","manufacturer_name":"innr","product_name":"Color temperature light","product_archetype":"classic_bulb","certified":false,"software_version":"2.0","hardware_platform_type":"1166-116"},"metadata":{"name":"Innr Color temperature light k","archetype":"classic_bulb"},"identify":{},"services":[{"rid":"0b6a4fea-d6bf-4fdc-9d64-b0cce39aae1c","rtype":"light"},{"rid":"9a0c590b-8869-4a26-960a-a094844e7f5d","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"6cc8c1fc-13d0-4f26-aafb-e2f8939fcd6a","id_v1":"/lights/7","product_data":{"model_id":"GL-C-008","manufacturer_name":"GLEDOPTO","product_name":"Extended color light","product_archetype":"classic_bulb","certified":false,"software_version":"2.0.2"},"metadata":{"name":"Gledopto controller Wardrobe","archetype":"ceiling_round"},"identify":{},"services":[{"rid":"bca61a7f-0471-4ac0-9500-0a43d291179a","rtype":"light"},{"rid":"8cc6e2d5-91fc-42bc-b7f8-bb82daac8978","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"f4ad9a2f-3504-4f8d-a99f-d1c0fd3b0ca0","id_v1":"/sensors/21","product_data":{"model_id":"SML001","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue motion sensor","product_archetype":"unknown_archetype","certified":true,"software_version":"1.1.27575","hardware_platform_type":"100b-10d"},"metadata":{"name":"Hue motion sensor 1","archetype":"unknown_archetype"},"identify":{},"services":[{"rid":"c0391352-aa54-43df-8cc2-ddb401a2ba55","rtype":"motion"},{"rid":"ca614f36-1194-4691-9cf5-69d2eabd9fca","rtype":"device_power"},{"rid":"ee5e6ea0-1467-477e-926c-197586f378f0","rtype":"zigbee_connectivity"},{"rid":"9277462f-a10b-4fbc-a7a3-0830b36116e3","rtype":"light_level"},{"rid":"3b9c4291-138e-4e36-9529-93edf2534c3a","rtype":"temperature"}],"type":"device"},{"id":"60e74cfe-d480-457b-8994-4f3a4f5d230e","id_v1":"/lights/1","product_data":{"model_id":"LTW010","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue ambiance lamp","product_archetype":"sultan_bulb","certified":true,"software_version":"1.88.1","hardware_platform_type":"100b-10c"},"metadata":{"name":"Hue ambiance lamp 1","archetype":"sultan_bulb"},"identify":{},"services":[{"rid":"7a13fe24-5c01-4e07-b076-4ac8ab0fe406","rtype":"light"},{"rid":"bc7299c6-2ee3-47c3-9425-aef37944c27d","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"01409ea5-3435-4be6-9698-469021626b26","id_v1":"/lights/17","product_data":{"model_id":"440400982842","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue Play","product_archetype":"hue_play","certified":true,"software_version":"1.93.11","hardware_platform_type":"100b-11f"},"metadata":{"name":"Hue Play 1 JP ","archetype":"hue_play"},"identify":{},"services":[{"rid":"3607afa7-bd81-4fb6-a694-38231fb912c5","rtype":"light"},{"rid":"43d7797d-dc2f-4bd5-8972-17933833b39f","rtype":"zigbee_connectivity"},{"rid":"6c028642-5130-4764-ab00-39e44890d01e","rtype":"entertainment"}],"type":"device"},{"id":"bd387ef5-c6d6-48ff-bd6f-c505c0fe217a","id_v1":"/sensors/34","product_data":{"model_id":"SML001","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue motion sensor","product_archetype":"unknown_archetype","certified":true,"software_version":"1.1.27575","hardware_platform_type":"100b-10d"},"metadata":{"name":"Hue motion sensor 2","archetype":"unknown_archetype"},"identify":{},"services":[{"rid":"c9819434-deb4-41c2-a09b-c7c3ebbe1e9e","rtype":"motion"},{"rid":"d63dc14e-0b66-4971-9bf2-d2c54b3034c5","rtype":"device_power"},{"rid":"58a03d1b-b184-4a4c-abc7-8ed901eda074","rtype":"zigbee_connectivity"},{"rid":"bed71b51-7576-4887-8a1b-899735dd4e7b","rtype":"light_level"},{"rid":"64098db1-11c5-4266-b241-352daaf8b3d5","rtype":"temperature"}],"type":"device"},{"id":"a21bc8a0-f6d8-4b7a-bdc7-6b8d6339245c","id_v1":"/sensors/26","product_data":{"model_id":"RWL022","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue dimmer switch","product_archetype":"unknown_archetype","certified":true,"software_version":"2.45.2","hardware_platform_type":"100b-119"},"metadata":{"name":"Hue dimmer Kitchen","archetype":"unknown_archetype"},"services":[{"rid":"8051d538-022b-4064-9961-1850ec687799","rtype":"button"},{"rid":"5c91dcf9-93ec-4f35-bd94-d569d6be887a","rtype":"button"},{"rid":"9842f574-8be3-4b40-9b0c-1aa40c4525c6","rtype":"button"},{"rid":"81983996-6dd2-4b27-8c5f-b161ab76f290","rtype":"button"},{"rid":"4b63535e-26c4-4191-80ce-b599ee825500","rtype":"device_power"},{"rid":"fc04e23a-2a31-4415-95d4-a8709aca5233","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"e7992ab7-7a4c-4ef7-b811-b71300b7c7c2","id_v1":"/lights/5","product_data":{"model_id":"FLOALT panel WS 60x60","manufacturer_name":"IKEA of Sweden","product_name":"Color temperature light","product_archetype":"classic_bulb","certified":false,"software_version":"1.2.217","hardware_platform_type":"117c-4202"},"metadata":{"name":"Ikea floalt basement","archetype":"ceiling_square"},"identify":{},"services":[{"rid":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","rtype":"light"},{"rid":"a8219e7d-3b37-40e5-bfd8-859bc7329d6e","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"208713e7-e7fb-49a8-b245-3c38757cbb65","id_v1":"/lights/8","product_data":{"model_id":"RB 278 T","manufacturer_name":"innr","product_name":"Color temperature light","product_archetype":"classic_bulb","certified":false,"software_version":"2.0","hardware_platform_type":"1166-116"},"metadata":{"name":"Innr light in plafond 1","archetype":"classic_bulb"},"identify":{},"services":[{"rid":"18153cfe-8bdc-4ec1-b866-a761c2eff249","rtype":"light"},{"rid":"b9b650c9-a6c0-4046-804f-318d9442ce2d","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"69dc4fd9-01e7-4329-ae0b-476ad339753c","id_v1":"","product_data":{"model_id":"BSB002","manufacturer_name":"Signify Netherlands B.V.","product_name":"Philips hue","product_archetype":"bridge_v2","certified":true,"software_version":"1.53.1953188020"},"metadata":{"name":"Philips hue","archetype":"bridge_v2"},"identify":{},"services":[{"rid":"1546cfb2-70a3-4b6c-a233-9ac38c7d4980","rtype":"bridge"},{"rid":"047aeeaf-8b88-4c78-893f-73babfa3f1af","rtype":"zigbee_connectivity"},{"rid":"e996e8b7-854f-4fee-a879-37f161e0bbd0","rtype":"entertainment"}],"type":"device"},{"id":"44c6f948-f01b-4d8f-8184-06646c9a49c7","id_v1":"/lights/6","product_data":{"model_id":"HK-SL-DIM-A","manufacturer_name":"Sunricher","product_name":"Dimmable light","product_archetype":"classic_bulb","certified":false,"software_version":"2.5.3","hardware_platform_type":"1224-7ef"},"metadata":{"name":"In hall wall dimmer living room","archetype":"double_spot"},"identify":{},"services":[{"rid":"f496b912-8022-46db-a42d-4ca706f18fd1","rtype":"light"},{"rid":"8654671e-88ca-419c-92b0-e2832ebc5ee8","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"2cebd321-c0dd-46a2-8dd5-a8599ff20ea6","id_v1":"/lights/14","product_data":{"model_id":"HK-SL-DIM-A","manufacturer_name":"Sunricher","product_name":"Dimmable light","product_archetype":"classic_bulb","certified":false,"software_version":"2.5.3","hardware_platform_type":"1224-12c"},"metadata":{"name":"Bedroom switch in wall","archetype":"classic_bulb"},"identify":{},"services":[{"rid":"ac483b54-be97-4178-ba14-85a926940835","rtype":"light"},{"rid":"81f02caf-6abd-4df2-ad9f-bef9a9c8b9eb","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"d9521271-04cd-4663-834e-4297e40da723","id_v1":"/lights/2","product_data":{"model_id":"LTW010","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue ambiance lamp","product_archetype":"sultan_bulb","certified":true,"software_version":"1.88.1","hardware_platform_type":"100b-10c"},"metadata":{"name":"Hue ambiance lamp 2","archetype":"sultan_bulb"},"identify":{},"services":[{"rid":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","rtype":"light"},{"rid":"2f6e7210-4f72-4b2b-9b71-aae63e897c55","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"cb263a90-dcdb-401d-8c55-e635a5750271","id_v1":"/lights/11","product_data":{"model_id":"LWA004","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue filament bulb","product_archetype":"vintage_bulb","certified":true,"software_version":"1.93.11","hardware_platform_type":"100b-112"},"metadata":{"name":"Hue filament bulb 1","archetype":"vintage_bulb"},"identify":{},"services":[{"rid":"d31255fd-9b4b-4aa9-9024-95cd7ef5a24a","rtype":"light"},{"rid":"beca27bb-52cb-4260-9ccf-c96fd3b030ff","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"ddf4472a-5ff0-47fe-8c0b-a34538afab7e","id_v1":"/lights/3","product_data":{"model_id":"3216231P6","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue Aurelle Panel","product_archetype":"ceiling_square","certified":true,"software_version":"1.93.11","hardware_platform_type":"100b-11d"},"metadata":{"name":"Hue panel Ann","archetype":"ceiling_square"},"identify":{},"services":[{"rid":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","rtype":"light"},{"rid":"6eaad07e-f542-4e99-b312-2b7aaf10f8e8","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"160aa08f-0c2d-4fcd-86e4-e7cce61e3e00","id_v1":"/sensors/43","product_data":{"model_id":"RWL022","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue dimmer switch","product_archetype":"unknown_archetype","certified":true,"software_version":"2.45.2","hardware_platform_type":"100b-119"},"metadata":{"name":"Hue dimmer switch bedroom","archetype":"unknown_archetype"},"services":[{"rid":"10e12bca-ea5b-41d3-9cf4-7d3ba3313668","rtype":"button"},{"rid":"7eae1fab-14c6-443a-8806-7bb7672e6e07","rtype":"button"},{"rid":"9e181f33-812a-4fb2-a19c-2906703242b0","rtype":"button"},{"rid":"b0680504-f7d0-4ca4-aac7-af8610d2b72c","rtype":"button"},{"rid":"6b2b900d-eb60-44f1-a292-33024b97966c","rtype":"device_power"},{"rid":"3e073eaa-228b-46ab-97e6-23514d88224d","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"de165f27-c5c2-4cb6-991d-9f484634597c","id_v1":"/lights/15","product_data":{"model_id":"RB 278 T","manufacturer_name":"innr","product_name":"Color temperature light","product_archetype":"classic_bulb","certified":false,"software_version":"2.0","hardware_platform_type":"1166-116"},"metadata":{"name":"Innr temp mir","archetype":"classic_bulb"},"identify":{},"services":[{"rid":"310eb325-763c-4adc-85ad-6a0e61c85b66","rtype":"light"},{"rid":"0767c012-a3b8-457e-86be-f3ad20d90dbb","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"5cb88df1-b324-449e-9351-f5df1a810779","id_v1":"/sensors/14","product_data":{"model_id":"RWL021","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue dimmer switch","product_archetype":"unknown_archetype","certified":true,"software_version":"1.1.28573","hardware_platform_type":"100b-109"},"metadata":{"name":"Irmeli's Switch","archetype":"unknown_archetype"},"services":[{"rid":"bfa1f321-06b4-4a44-9256-9988ebd74cf8","rtype":"button"},{"rid":"3d3d0775-c14a-4530-932e-4374a7ae5c76","rtype":"button"},{"rid":"1041ac07-2a3b-4a43-ae75-a9bf2e30edd0","rtype":"button"},{"rid":"dd31fa5f-51bd-4b48-9321-2798d684e718","rtype":"button"},{"rid":"0e73be15-abc8-4cde-abcb-3a37e1219fcc","rtype":"device_power"},{"rid":"ecd27858-7746-4a9f-a3a4-d2a765201608","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"67fb62ca-d9ab-4b1b-bb4c-c7e0fc473f83","id_v1":"/lights/10","product_data":{"model_id":"RB 278 T","manufacturer_name":"innr","product_name":"Color temperature light","product_archetype":"classic_bulb","certified":false,"software_version":"2.0","hardware_platform_type":"1166-116"},"metadata":{"name":"Innr plafond 3","archetype":"classic_bulb"},"identify":{},"services":[{"rid":"0bc36433-732a-4147-b535-996e84f6581d","rtype":"light"},{"rid":"cc1fd67b-66ff-46c2-a3be-af635483c192","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"68b79717-5775-4424-820e-9db70658de9f","id_v1":"/lights/13","product_data":{"model_id":"SM309","manufacturer_name":"Samotech","product_name":"Hue white light","product_archetype":"classic_bulb","certified":true,"software_version":"2.5.3","hardware_platform_type":"100b-7d6"},"metadata":{"name":"in center wall eat room","archetype":"single_spot"},"identify":{},"services":[{"rid":"f4869d00-b9e7-494d-8bfc-e58f9a432504","rtype":"light"},{"rid":"f0c6bc21-d988-43b1-b910-df9cc07dab85","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"b372bc87-6fe5-4b1d-a2c7-294628874dd0","id_v1":"/lights/4","product_data":{"model_id":"3216231P6","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue Aurelle Panel","product_archetype":"ceiling_square","certified":true,"software_version":"1.93.11","hardware_platform_type":"100b-11d"},"metadata":{"name":"Hue Aurelle JP","archetype":"ceiling_square"},"identify":{},"services":[{"rid":"640686ce-9fb6-47fb-8b81-49b2562f12f8","rtype":"light"},{"rid":"783fda2a-80d5-4214-a71f-8a8a3233d25f","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"75be1128-6d2e-4c46-bf85-ded7f96bb88b","id_v1":"/lights/9","product_data":{"model_id":"RB 278 T","manufacturer_name":"innr","product_name":"Color temperature light","product_archetype":"classic_bulb","certified":false,"software_version":"2.0","hardware_platform_type":"1166-116"},"metadata":{"name":"Innr plafond 2","archetype":"classic_bulb"},"identify":{},"services":[{"rid":"8630af91-e448-4b34-ac3a-aeadf96d65cf","rtype":"light"},{"rid":"b7cbd191-39ac-41c1-9ecc-915ae69d5e73","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"d6ec7504-d8fd-4e70-953b-bed1ee7b5071","id_v1":"/sensors/11","product_data":{"model_id":"RWL021","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue dimmer switch","product_archetype":"unknown_archetype","certified":true,"software_version":"1.1.28573","hardware_platform_type":"100b-109"},"metadata":{"name":"JP Switch","archetype":"unknown_archetype"},"services":[{"rid":"6b180589-4912-4ab2-adaa-0a1b45d9705c","rtype":"button"},{"rid":"8d1d1237-dcb3-44b7-8aee-892b829118ca","rtype":"button"},{"rid":"998db095-b8b6-42bb-9395-e8fe02e26975","rtype":"button"},{"rid":"b4eb4e5f-6637-4282-a620-adeeaf37906e","rtype":"button"},{"rid":"a1715c45-edc8-4cc8-bba8-5ad849ae25fb","rtype":"device_power"},{"rid":"abacaab4-764e-4600-ac1f-c7fcda0e42f8","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"43db65e4-5fcb-4284-ab44-96cd1f3c44f9","id_v1":"/sensors/39","product_data":{"model_id":"RWL022","manufacturer_name":"Signify Netherlands B.V.","product_name":"Hue dimmer switch","product_archetype":"unknown_archetype","certified":true,"software_version":"2.45.2","hardware_platform_type":"100b-119"},"metadata":{"name":"Dimmer switch liv room downs","archetype":"unknown_archetype"},"services":[{"rid":"3f752d8e-3893-4c96-ab68-242d3b3c5922","rtype":"button"},{"rid":"4c71a248-964f-4229-8e13-766809ec3026","rtype":"button"},{"rid":"de6c38fc-5f68-4a17-996e-effe4edaa738","rtype":"button"},{"rid":"0084edf2-7238-4943-86d5-38347aa3ff7e","rtype":"button"},{"rid":"7cf866a8-ffff-4543-82ce-199b1928d198","rtype":"device_power"},{"rid":"027f031d-7149-4782-9eb1-bc39c97636c6","rtype":"zigbee_connectivity"}],"type":"device"},{"id":"0b6a4fea-d6bf-4fdc-9d64-b0cce39aae1c","id_v1":"/lights/12","owner":{"rid":"9edae97f-fec9-4b6a-86aa-35d7733c56b4","rtype":"device"},"metadata":{"name":"Innr Color temperature light k","archetype":"classic_bulb"},"on":{"on":false},"dimming":{"brightness":79.92},"dimming_delta":{},"color_temperature":{"mirek":366,"mirek_valid":true,"mirek_schema":{"mirek_minimum":200,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"bca61a7f-0471-4ac0-9500-0a43d291179a","id_v1":"/lights/7","owner":{"rid":"6cc8c1fc-13d0-4f26-aafb-e2f8939fcd6a","rtype":"device"},"metadata":{"name":"Gledopto controller Wardrobe","archetype":"ceiling_round"},"on":{"on":true},"dimming":{"brightness":100.0},"dimming_delta":{},"color_temperature":{"mirek":366,"mirek_valid":true,"mirek_schema":{"mirek_minimum":155,"mirek_maximum":495}},"color_temperature_delta":{},"color":{"xy":{"x":0.4584,"y":0.41}},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"7a13fe24-5c01-4e07-b076-4ac8ab0fe406","id_v1":"/lights/1","owner":{"rid":"60e74cfe-d480-457b-8994-4f3a4f5d230e","rtype":"device"},"metadata":{"name":"Hue ambiance lamp 1","archetype":"sultan_bulb"},"on":{"on":true},"dimming":{"brightness":100.0,"min_dim_level":1.0},"dimming_delta":{},"color_temperature":{"mirek":366,"mirek_valid":true,"mirek_schema":{"mirek_minimum":153,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"3607afa7-bd81-4fb6-a694-38231fb912c5","id_v1":"/lights/17","owner":{"rid":"01409ea5-3435-4be6-9698-469021626b26","rtype":"device"},"metadata":{"name":"Hue Play 1 JP ","archetype":"hue_play"},"on":{"on":true},"dimming":{"brightness":42.13,"min_dim_level":0.10000000149011612},"dimming_delta":{},"color_temperature":{"mirek":null,"mirek_valid":false,"mirek_schema":{"mirek_minimum":153,"mirek_maximum":500}},"color_temperature_delta":{},"color":{"xy":{"x":0.1825,"y":0.0695},"gamut":{"red":{"x":0.6915,"y":0.3083},"green":{"x":0.17,"y":0.7},"blue":{"x":0.1532,"y":0.0475}},"gamut_type":"C"},"dynamics":{"status":"none","status_values":["none","dynamic_palette"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","effects":{"status_values":["no_effect","candle","fire"],"status":"no_effect","effect_values":["no_effect","candle","fire"]},"type":"light"},{"id":"d3a1f099-a94c-4da6-9bb7-9cdd1fe713c6","id_v1":"/lights/5","owner":{"rid":"e7992ab7-7a4c-4ef7-b811-b71300b7c7c2","rtype":"device"},"metadata":{"name":"Ikea floalt basement","archetype":"ceiling_square"},"on":{"on":false},"dimming":{"brightness":100.0},"dimming_delta":{},"color_temperature":{"mirek":250,"mirek_valid":true,"mirek_schema":{"mirek_minimum":250,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"18153cfe-8bdc-4ec1-b866-a761c2eff249","id_v1":"/lights/8","owner":{"rid":"208713e7-e7fb-49a8-b245-3c38757cbb65","rtype":"device"},"metadata":{"name":"Innr light in plafond 1","archetype":"classic_bulb"},"on":{"on":true},"dimming":{"brightness":37.4},"dimming_delta":{},"color_temperature":{"mirek":447,"mirek_valid":true,"mirek_schema":{"mirek_minimum":200,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"f496b912-8022-46db-a42d-4ca706f18fd1","id_v1":"/lights/6","owner":{"rid":"44c6f948-f01b-4d8f-8184-06646c9a49c7","rtype":"device"},"metadata":{"name":"In hall wall dimmer living room","archetype":"double_spot"},"on":{"on":false},"dimming":{"brightness":50.39},"dimming_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"ac483b54-be97-4178-ba14-85a926940835","id_v1":"/lights/14","owner":{"rid":"2cebd321-c0dd-46a2-8dd5-a8599ff20ea6","rtype":"device"},"metadata":{"name":"Bedroom switch in wall","archetype":"classic_bulb"},"on":{"on":true},"dimming":{"brightness":100.0},"dimming_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"bdafb1f9-e28c-4e75-92c0-3a35423b7eee","id_v1":"/lights/2","owner":{"rid":"d9521271-04cd-4663-834e-4297e40da723","rtype":"device"},"metadata":{"name":"Hue ambiance lamp 2","archetype":"sultan_bulb"},"on":{"on":true},"dimming":{"brightness":100.0,"min_dim_level":1.0},"dimming_delta":{},"color_temperature":{"mirek":366,"mirek_valid":true,"mirek_schema":{"mirek_minimum":153,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"d31255fd-9b4b-4aa9-9024-95cd7ef5a24a","id_v1":"/lights/11","owner":{"rid":"cb263a90-dcdb-401d-8c55-e635a5750271","rtype":"device"},"metadata":{"name":"Hue filament bulb 1","archetype":"vintage_bulb"},"on":{"on":false},"dimming":{"brightness":100.0,"min_dim_level":2.0},"dimming_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","effects":{"status_values":["no_effect","candle"],"status":"no_effect","effect_values":["no_effect","candle"]},"type":"light"},{"id":"ebc4f73d-6aed-464c-a4f4-cc6cd8c43cde","id_v1":"/lights/3","owner":{"rid":"ddf4472a-5ff0-47fe-8c0b-a34538afab7e","rtype":"device"},"metadata":{"name":"Hue panel Ann","archetype":"ceiling_square"},"on":{"on":true},"dimming":{"brightness":100.0,"min_dim_level":0.10000000149011612},"dimming_delta":{},"color_temperature":{"mirek":366,"mirek_valid":true,"mirek_schema":{"mirek_minimum":153,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","effects":{"status_values":["no_effect","candle"],"status":"no_effect","effect_values":["no_effect","candle"]},"type":"light"},{"id":"310eb325-763c-4adc-85ad-6a0e61c85b66","id_v1":"/lights/15","owner":{"rid":"de165f27-c5c2-4cb6-991d-9f484634597c","rtype":"device"},"metadata":{"name":"Innr temp mir","archetype":"classic_bulb"},"on":{"on":true},"dimming":{"brightness":100.0},"dimming_delta":{},"color_temperature":{"mirek":344,"mirek_valid":true,"mirek_schema":{"mirek_minimum":200,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"0bc36433-732a-4147-b535-996e84f6581d","id_v1":"/lights/10","owner":{"rid":"67fb62ca-d9ab-4b1b-bb4c-c7e0fc473f83","rtype":"device"},"metadata":{"name":"Innr plafond 3","archetype":"classic_bulb"},"on":{"on":true},"dimming":{"brightness":37.4},"dimming_delta":{},"color_temperature":{"mirek":447,"mirek_valid":true,"mirek_schema":{"mirek_minimum":200,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"f4869d00-b9e7-494d-8bfc-e58f9a432504","id_v1":"/lights/13","owner":{"rid":"68b79717-5775-4424-820e-9db70658de9f","rtype":"device"},"metadata":{"name":"in center wall eat room","archetype":"single_spot"},"on":{"on":false},"dimming":{"brightness":50.39},"dimming_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"640686ce-9fb6-47fb-8b81-49b2562f12f8","id_v1":"/lights/4","owner":{"rid":"b372bc87-6fe5-4b1d-a2c7-294628874dd0","rtype":"device"},"metadata":{"name":"Hue Aurelle JP","archetype":"ceiling_square"},"on":{"on":true},"dimming":{"brightness":43.31,"min_dim_level":0.10000000149011612},"dimming_delta":{},"color_temperature":{"mirek":451,"mirek_valid":true,"mirek_schema":{"mirek_minimum":153,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","effects":{"status_values":["no_effect","candle"],"status":"no_effect","effect_values":["no_effect","candle"]},"type":"light"},{"id":"8630af91-e448-4b34-ac3a-aeadf96d65cf","id_v1":"/lights/9","owner":{"rid":"75be1128-6d2e-4c46-bf85-ded7f96bb88b","rtype":"device"},"metadata":{"name":"Innr plafond 2","archetype":"classic_bulb"},"on":{"on":true},"dimming":{"brightness":37.4},"dimming_delta":{},"color_temperature":{"mirek":447,"mirek_valid":true,"mirek_schema":{"mirek_minimum":200,"mirek_maximum":454}},"color_temperature_delta":{},"dynamics":{"status":"none","status_values":["none"],"speed":0.0,"speed_valid":false},"alert":{"action_values":["breathe"]},"signaling":{},"mode":"normal","type":"light"},{"id":"9a0c590b-8869-4a26-960a-a094844e7f5d","id_v1":"/lights/12","owner":{"rid":"9edae97f-fec9-4b6a-86aa-35d7733c56b4","rtype":"device"},"status":"connected","mac_address":"00:15:8d:00:07:36:70:4d","type":"zigbee_connectivity"},{"id":"8cc6e2d5-91fc-42bc-b7f8-bb82daac8978","id_v1":"/lights/7","owner":{"rid":"6cc8c1fc-13d0-4f26-aafb-e2f8939fcd6a","rtype":"device"},"status":"connected","mac_address":"00:12:4b:00:23:b2:a6:c6","type":"zigbee_connectivity"},{"id":"ee5e6ea0-1467-477e-926c-197586f378f0","id_v1":"/sensors/21","owner":{"rid":"f4ad9a2f-3504-4f8d-a99f-d1c0fd3b0ca0","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:09:18:3e:5d","type":"zigbee_connectivity"},{"id":"bc7299c6-2ee3-47c3-9425-aef37944c27d","id_v1":"/lights/1","owner":{"rid":"60e74cfe-d480-457b-8994-4f3a4f5d230e","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:06:16:63:51","type":"zigbee_connectivity"},{"id":"43d7797d-dc2f-4bd5-8972-17933833b39f","id_v1":"/lights/17","owner":{"rid":"01409ea5-3435-4be6-9698-469021626b26","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:0b:e6:11:71","type":"zigbee_connectivity"},{"id":"58a03d1b-b184-4a4c-abc7-8ed901eda074","id_v1":"/sensors/34","owner":{"rid":"bd387ef5-c6d6-48ff-bd6f-c505c0fe217a","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:09:18:e7:f9","type":"zigbee_connectivity"},{"id":"fc04e23a-2a31-4415-95d4-a8709aca5233","id_v1":"/sensors/26","owner":{"rid":"a21bc8a0-f6d8-4b7a-bdc7-6b8d6339245c","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:09:a4:cd:41","type":"zigbee_connectivity"},{"id":"a8219e7d-3b37-40e5-bfd8-859bc7329d6e","id_v1":"/lights/5","owner":{"rid":"e7992ab7-7a4c-4ef7-b811-b71300b7c7c2","rtype":"device"},"status":"connected","mac_address":"ec:1b:bd:ff:fe:8e:d0:0c","type":"zigbee_connectivity"},{"id":"b9b650c9-a6c0-4046-804f-318d9442ce2d","id_v1":"/lights/8","owner":{"rid":"208713e7-e7fb-49a8-b245-3c38757cbb65","rtype":"device"},"status":"connectivity_issue","mac_address":"00:15:8d:00:07:38:27:8b","type":"zigbee_connectivity"},{"id":"047aeeaf-8b88-4c78-893f-73babfa3f1af","id_v1":"","owner":{"rid":"69dc4fd9-01e7-4329-ae0b-476ad339753c","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:05:25:98:01","type":"zigbee_connectivity"},{"id":"8654671e-88ca-419c-92b0-e2832ebc5ee8","id_v1":"/lights/6","owner":{"rid":"44c6f948-f01b-4d8f-8184-06646c9a49c7","rtype":"device"},"status":"connected","mac_address":"84:fd:27:ff:fe:6a:74:4b","type":"zigbee_connectivity"},{"id":"81f02caf-6abd-4df2-ad9f-bef9a9c8b9eb","id_v1":"/lights/14","owner":{"rid":"2cebd321-c0dd-46a2-8dd5-a8599ff20ea6","rtype":"device"},"status":"connected","mac_address":"90:35:ea:ff:fe:93:05:8f","type":"zigbee_connectivity"},{"id":"2f6e7210-4f72-4b2b-9b71-aae63e897c55","id_v1":"/lights/2","owner":{"rid":"d9521271-04cd-4663-834e-4297e40da723","rtype":"device"},"status":"connectivity_issue","mac_address":"00:17:88:01:06:ef:2f:32","type":"zigbee_connectivity"},{"id":"beca27bb-52cb-4260-9ccf-c96fd3b030ff","id_v1":"/lights/11","owner":{"rid":"cb263a90-dcdb-401d-8c55-e635a5750271","rtype":"device"},"status":"connectivity_issue","mac_address":"00:17:88:01:0b:08:ae:37","type":"zigbee_connectivity"},{"id":"6eaad07e-f542-4e99-b312-2b7aaf10f8e8","id_v1":"/lights/3","owner":{"rid":"ddf4472a-5ff0-47fe-8c0b-a34538afab7e","rtype":"device"},"status":"connectivity_issue","mac_address":"00:17:88:01:06:7e:4e:dc","type":"zigbee_connectivity"},{"id":"3e073eaa-228b-46ab-97e6-23514d88224d","id_v1":"/sensors/43","owner":{"rid":"160aa08f-0c2d-4fcd-86e4-e7cce61e3e00","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:09:a6:8c:3a","type":"zigbee_connectivity"},{"id":"0767c012-a3b8-457e-86be-f3ad20d90dbb","id_v1":"/lights/15","owner":{"rid":"de165f27-c5c2-4cb6-991d-9f484634597c","rtype":"device"},"status":"connectivity_issue","mac_address":"00:15:8d:00:07:36:6c:78","type":"zigbee_connectivity"},{"id":"ecd27858-7746-4a9f-a3a4-d2a765201608","id_v1":"/sensors/14","owner":{"rid":"5cb88df1-b324-449e-9351-f5df1a810779","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:08:6b:6e:99","type":"zigbee_connectivity"},{"id":"cc1fd67b-66ff-46c2-a3be-af635483c192","id_v1":"/lights/10","owner":{"rid":"67fb62ca-d9ab-4b1b-bb4c-c7e0fc473f83","rtype":"device"},"status":"connectivity_issue","mac_address":"00:15:8d:00:06:e1:5b:29","type":"zigbee_connectivity"},{"id":"f0c6bc21-d988-43b1-b910-df9cc07dab85","id_v1":"/lights/13","owner":{"rid":"68b79717-5775-4424-820e-9db70658de9f","rtype":"device"},"status":"connected","mac_address":"b4:e3:f9:ff:fe:c6:57:db","type":"zigbee_connectivity"},{"id":"783fda2a-80d5-4214-a71f-8a8a3233d25f","id_v1":"/lights/4","owner":{"rid":"b372bc87-6fe5-4b1d-a2c7-294628874dd0","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:06:7e:56:04","type":"zigbee_connectivity"},{"id":"b7cbd191-39ac-41c1-9ecc-915ae69d5e73","id_v1":"/lights/9","owner":{"rid":"75be1128-6d2e-4c46-bf85-ded7f96bb88b","rtype":"device"},"status":"connectivity_issue","mac_address":"00:15:8d:00:07:36:7d:0c","type":"zigbee_connectivity"},{"id":"abacaab4-764e-4600-ac1f-c7fcda0e42f8","id_v1":"/sensors/11","owner":{"rid":"d6ec7504-d8fd-4e70-953b-bed1ee7b5071","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:08:6b:59:55","type":"zigbee_connectivity"},{"id":"027f031d-7149-4782-9eb1-bc39c97636c6","id_v1":"/sensors/39","owner":{"rid":"43db65e4-5fcb-4284-ab44-96cd1f3c44f9","rtype":"device"},"status":"connected","mac_address":"00:17:88:01:09:a6:90:f6","type":"zigbee_connectivity"},{"id":"c0391352-aa54-43df-8cc2-ddb401a2ba55","id_v1":"/sensors/21","owner":{"rid":"f4ad9a2f-3504-4f8d-a99f-d1c0fd3b0ca0","rtype":"device"},"enabled":true,"motion":{"motion":false,"motion_valid":true},"type":"motion"},{"id":"c9819434-deb4-41c2-a09b-c7c3ebbe1e9e","id_v1":"/sensors/34","owner":{"rid":"bd387ef5-c6d6-48ff-bd6f-c505c0fe217a","rtype":"device"},"enabled":true,"motion":{"motion":true,"motion_valid":true},"type":"motion"},{"id":"ca614f36-1194-4691-9cf5-69d2eabd9fca","id_v1":"/sensors/21","owner":{"rid":"f4ad9a2f-3504-4f8d-a99f-d1c0fd3b0ca0","rtype":"device"},"power_state":{"battery_state":"normal","battery_level":100},"type":"device_power"},{"id":"d63dc14e-0b66-4971-9bf2-d2c54b3034c5","id_v1":"/sensors/34","owner":{"rid":"bd387ef5-c6d6-48ff-bd6f-c505c0fe217a","rtype":"device"},"power_state":{"battery_state":"normal","battery_level":100},"type":"device_power"},{"id":"4b63535e-26c4-4191-80ce-b599ee825500","id_v1":"/sensors/26","owner":{"rid":"a21bc8a0-f6d8-4b7a-bdc7-6b8d6339245c","rtype":"device"},"power_state":{"battery_state":"normal","battery_level":91},"type":"device_power"},{"id":"6b2b900d-eb60-44f1-a292-33024b97966c","id_v1":"/sensors/43","owner":{"rid":"160aa08f-0c2d-4fcd-86e4-e7cce61e3e00","rtype":"device"},"power_state":{"battery_state":"normal","battery_level":100},"type":"device_power"},{"id":"0e73be15-abc8-4cde-abcb-3a37e1219fcc","id_v1":"/sensors/14","owner":{"rid":"5cb88df1-b324-449e-9351-f5df1a810779","rtype":"device"},"power_state":{"battery_state":"normal","battery_level":67},"type":"device_power"},{"id":"a1715c45-edc8-4cc8-bba8-5ad849ae25fb","id_v1":"/sensors/11","owner":{"rid":"d6ec7504-d8fd-4e70-953b-bed1ee7b5071","rtype":"device"},"power_state":{"battery_state":"normal","battery_level":91},"type":"device_power"},{"id":"7cf866a8-ffff-4543-82ce-199b1928d198","id_v1":"/sensors/39","owner":{"rid":"43db65e4-5fcb-4284-ab44-96cd1f3c44f9","rtype":"device"},"power_state":{"battery_state":"normal","battery_level":85},"type":"device_power"},{"id":"9277462f-a10b-4fbc-a7a3-0830b36116e3","id_v1":"/sensors/22","owner":{"rid":"f4ad9a2f-3504-4f8d-a99f-d1c0fd3b0ca0","rtype":"device"},"enabled":true,"light":{"light_level":10915,"light_level_valid":true},"type":"light_level"},{"id":"bed71b51-7576-4887-8a1b-899735dd4e7b","id_v1":"/sensors/35","owner":{"rid":"bd387ef5-c6d6-48ff-bd6f-c505c0fe217a","rtype":"device"},"enabled":true,"light":{"light_level":14134,"light_level_valid":true},"type":"light_level"},{"id":"3b9c4291-138e-4e36-9529-93edf2534c3a","id_v1":"/sensors/23","owner":{"rid":"f4ad9a2f-3504-4f8d-a99f-d1c0fd3b0ca0","rtype":"device"},"enabled":true,"temperature":{"temperature":17.94,"temperature_valid":true},"type":"temperature"},{"id":"64098db1-11c5-4266-b241-352daaf8b3d5","id_v1":"/sensors/36","owner":{"rid":"bd387ef5-c6d6-48ff-bd6f-c505c0fe217a","rtype":"device"},"enabled":true,"temperature":{"temperature":8.07,"temperature_valid":true},"type":"temperature"},{"id":"6c028642-5130-4764-ab00-39e44890d01e","id_v1":"/lights/17","owner":{"rid":"01409ea5-3435-4be6-9698-469021626b26","rtype":"device"},"renderer":true,"proxy":true,"segments":{"configurable":false,"max_segments":1,"segments":[{"start":0,"length":1}]},"type":"entertainment"},{"id":"e996e8b7-854f-4fee-a879-37f161e0bbd0","id_v1":"","owner":{"rid":"69dc4fd9-01e7-4329-ae0b-476ad339753c","rtype":"device"},"renderer":false,"proxy":true,"type":"entertainment"},{"id":"8051d538-022b-4064-9961-1850ec687799","id_v1":"/sensors/26","owner":{"rid":"a21bc8a0-f6d8-4b7a-bdc7-6b8d6339245c","rtype":"device"},"metadata":{"control_id":1},"button":{"last_event":"short_release"},"type":"button"},{"id":"5c91dcf9-93ec-4f35-bd94-d569d6be887a","id_v1":"/sensors/26","owner":{"rid":"a21bc8a0-f6d8-4b7a-bdc7-6b8d6339245c","rtype":"device"},"metadata":{"control_id":2},"type":"button"},{"id":"9842f574-8be3-4b40-9b0c-1aa40c4525c6","id_v1":"/sensors/26","owner":{"rid":"a21bc8a0-f6d8-4b7a-bdc7-6b8d6339245c","rtype":"device"},"metadata":{"control_id":3},"type":"button"},{"id":"81983996-6dd2-4b27-8c5f-b161ab76f290","id_v1":"/sensors/26","owner":{"rid":"a21bc8a0-f6d8-4b7a-bdc7-6b8d6339245c","rtype":"device"},"metadata":{"control_id":4},"type":"button"},{"id":"10e12bca-ea5b-41d3-9cf4-7d3ba3313668","id_v1":"/sensors/43","owner":{"rid":"160aa08f-0c2d-4fcd-86e4-e7cce61e3e00","rtype":"device"},"metadata":{"control_id":1},"button":{"last_event":"short_release"},"type":"button"},{"id":"7eae1fab-14c6-443a-8806-7bb7672e6e07","id_v1":"/sensors/43","owner":{"rid":"160aa08f-0c2d-4fcd-86e4-e7cce61e3e00","rtype":"device"},"metadata":{"control_id":2},"type":"button"},{"id":"9e181f33-812a-4fb2-a19c-2906703242b0","id_v1":"/sensors/43","owner":{"rid":"160aa08f-0c2d-4fcd-86e4-e7cce61e3e00","rtype":"device"},"metadata":{"control_id":3},"type":"button"},{"id":"b0680504-f7d0-4ca4-aac7-af8610d2b72c","id_v1":"/sensors/43","owner":{"rid":"160aa08f-0c2d-4fcd-86e4-e7cce61e3e00","rtype":"device"},"metadata":{"control_id":4},"type":"button"},{"id":"bfa1f321-06b4-4a44-9256-9988ebd74cf8","id_v1":"/sensors/14","owner":{"rid":"5cb88df1-b324-449e-9351-f5df1a810779","rtype":"device"},"metadata":{"control_id":1},"type":"button"},{"id":"3d3d0775-c14a-4530-932e-4374a7ae5c76","id_v1":"/sensors/14","owner":{"rid":"5cb88df1-b324-449e-9351-f5df1a810779","rtype":"device"},"metadata":{"control_id":2},"button":{"last_event":"short_release"},"type":"button"},{"id":"1041ac07-2a3b-4a43-ae75-a9bf2e30edd0","id_v1":"/sensors/14","owner":{"rid":"5cb88df1-b324-449e-9351-f5df1a810779","rtype":"device"},"metadata":{"control_id":3},"type":"button"},{"id":"dd31fa5f-51bd-4b48-9321-2798d684e718","id_v1":"/sensors/14","owner":{"rid":"5cb88df1-b324-449e-9351-f5df1a810779","rtype":"device"},"metadata":{"control_id":4},"type":"button"},{"id":"6b180589-4912-4ab2-adaa-0a1b45d9705c","id_v1":"/sensors/11","owner":{"rid":"d6ec7504-d8fd-4e70-953b-bed1ee7b5071","rtype":"device"},"metadata":{"control_id":1},"type":"button"},{"id":"8d1d1237-dcb3-44b7-8aee-892b829118ca","id_v1":"/sensors/11","owner":{"rid":"d6ec7504-d8fd-4e70-953b-bed1ee7b5071","rtype":"device"},"metadata":{"control_id":2},"button":{"last_event":"long_release"},"type":"button"},{"id":"998db095-b8b6-42bb-9395-e8fe02e26975","id_v1":"/sensors/11","owner":{"rid":"d6ec7504-d8fd-4e70-953b-bed1ee7b5071","rtype":"device"},"metadata":{"control_id":3},"type":"button"},{"id":"b4eb4e5f-6637-4282-a620-adeeaf37906e","id_v1":"/sensors/11","owner":{"rid":"d6ec7504-d8fd-4e70-953b-bed1ee7b5071","rtype":"device"},"metadata":{"control_id":4},"type":"button"},{"id":"3f752d8e-3893-4c96-ab68-242d3b3c5922","id_v1":"/sensors/39","owner":{"rid":"43db65e4-5fcb-4284-ab44-96cd1f3c44f9","rtype":"device"},"metadata":{"control_id":1},"button":{"last_event":"short_release"},"type":"button"},{"id":"4c71a248-964f-4229-8e13-766809ec3026","id_v1":"/sensors/39","owner":{"rid":"43db65e4-5fcb-4284-ab44-96cd1f3c44f9","rtype":"device"},"metadata":{"control_id":2},"type":"button"},{"id":"de6c38fc-5f68-4a17-996e-effe4edaa738","id_v1":"/sensors/39","owner":{"rid":"43db65e4-5fcb-4284-ab44-96cd1f3c44f9","rtype":"device"},"metadata":{"control_id":3},"type":"button"},{"id":"0084edf2-7238-4943-86d5-38347aa3ff7e","id_v1":"/sensors/39","owner":{"rid":"43db65e4-5fcb-4284-ab44-96cd1f3c44f9","rtype":"device"},"metadata":{"control_id":4},"type":"button"},{"id":"1546cfb2-70a3-4b6c-a233-9ac38c7d4980","id_v1":"","owner":{"rid":"69dc4fd9-01e7-4329-ae0b-476ad339753c","rtype":"device"},"bridge_id":"ecb5fafffe259801","time_zone":{"time_zone":"Europe/Stockholm"},"type":"bridge"},{"id":"07bfb801-8250-4a40-8878-9d7d09ad0eed","id_v1":"/groups/0","children":[{"rid":"5275317f-dc25-4a07-a35e-3ff349de557d","rtype":"room"},{"rid":"581d7d2d-8cdc-4462-99d4-79182f44b63a","rtype":"room"},{"rid":"e9d97c83-2488-4c58-8ccc-113e4423f199","rtype":"room"},{"rid":"53a67a3f-96c9-4af6-97a2-0c9bb968f9e7","rtype":"room"},{"rid":"8c934c0d-02e9-4e98-ad85-b9dd10542034","rtype":"room"},{"rid":"4507426b-1d39-4da5-bec6-0e1dce4bcae9","rtype":"room"},{"rid":"9b7589fa-b68c-4b39-a837-3f0c0ccce73a","rtype":"room"},{"rid":"ddfd3d7c-4795-4774-be9c-9c67b194c5a1","rtype":"room"},{"rid":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","rtype":"room"},{"rid":"32bc3a88-083a-41b8-bf12-84a7409143b2","rtype":"room"},{"rid":"e4b0ca1d-d9a5-4a92-9ace-1eca930af209","rtype":"room"},{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},{"rid":"d6ec7504-d8fd-4e70-953b-bed1ee7b5071","rtype":"device"},{"rid":"5cb88df1-b324-449e-9351-f5df1a810779","rtype":"device"},{"rid":"f4ad9a2f-3504-4f8d-a99f-d1c0fd3b0ca0","rtype":"device"},{"rid":"a21bc8a0-f6d8-4b7a-bdc7-6b8d6339245c","rtype":"device"},{"rid":"bd387ef5-c6d6-48ff-bd6f-c505c0fe217a","rtype":"device"},{"rid":"43db65e4-5fcb-4284-ab44-96cd1f3c44f9","rtype":"device"},{"rid":"160aa08f-0c2d-4fcd-86e4-e7cce61e3e00","rtype":"device"}],"services":[{"rid":"656089a4-df66-4415-9e73-ad0c4d4f82a5","rtype":"grouped_light"}],"type":"bridge_home"},{"configuration_schema":{"$ref":"basic_goto_sleep_config.json#"},"description":"Get ready for nice sleep.","id":"7e571ac6-f363-42e1-809a-4cbf6523ed72","metadata":{"category":"automation","name":"Basic go to sleep routine"},"state_schema":{},"supported_features":[],"trigger_schema":{"$ref":"trigger.json#"},"type":"behavior_script","version":"0.0.1"},{"configuration_schema":{"$ref":"basic_wake_up_config.json#"},"description":"Get your body in the mood to wake up by fading on the lights in the morning.","id":"ff8957e3-2eb9-4699-a0c8-ad2cb3ede704","metadata":{"category":"automation","name":"Basic wake up routine"},"state_schema":{},"supported_features":["style_sunrise","intensity"],"trigger_schema":{"$ref":"trigger.json#"},"type":"behavior_script","version":"0.0.1"},{"configuration_schema":{"$ref":"coming_home_config.json#"},"description":"Automatically turn your lights to choosen light states, when you arrive at home.","id":"fd60fcd1-4809-4813-b510-4a18856a595c","metadata":{"category":"automation","name":"Coming home"},"state_schema":{},"supported_features":[],"trigger_schema":{"$ref":"trigger.json#"},"type":"behavior_script","version":"0.0.1"},{"configuration_schema":{"$ref":"leaving_home_config.json#"},"description":"Automatically turn off your lights when you leave","id":"0194752a-2d53-4f92-8209-dfdc52745af3","metadata":{"category":"automation","name":"Leaving home"},"state_schema":{},"supported_features":[],"trigger_schema":{"$ref":"trigger.json#"},"type":"behavior_script","version":"0.0.1"},{"configuration_schema":{"$ref":"schedule_config.json#"},"description":"Schedule turning on and off lights","id":"7238c707-8693-4f19-9095-ccdc1444d228","metadata":{"category":"automation","name":"Schedule"},"state_schema":{},"supported_features":[],"trigger_schema":{"$ref":"trigger.json#"},"type":"behavior_script","version":"0.0.1"},{"configuration_schema":{"$ref":"timer_config.json#"},"description":"Countdown Timer","id":"e73bc72d-96b1-46f8-aa57-729861f80c78","metadata":{"category":"automation","name":"Timers"},"state_schema":{"$ref":"timer_state.json#"},"supported_features":[],"trigger_schema":{"$ref":"trigger.json#"},"type":"behavior_script","version":"0.0.1"},{"configuration_schema":{"$ref":"pm_config.json#"},"description":"PM Automation","id":"db06cabc-c752-4904-9e8f-4ebe98feaa1a","max_number_instances":1,"metadata":{"category":"automation","name":"PM"},"state_schema":{"$ref":"pm_state.json#"},"supported_features":[],"trigger_schema":{"$ref":"pm_trigger.json#"},"type":"behavior_script","version":"0.0.1"},{"configuration_schema":{"$ref":"lights_state_after_streaming_config.json#"},"description":"State of lights in the entertainment group after streaming ends","id":"7719b841-6b3d-448d-a0e7-601ae9edb6a2","metadata":{"category":"entertainment","name":"Light state after streaming"},"state_schema":{},"supported_features":[],"trigger_schema":{},"type":"behavior_script","version":"0.0.1"},{"configuration_schema":{"$ref":"natural_light_config.json#"},"description":"Natural light during the day","id":"a4260b49-0c69-4926-a29c-417f4a38a352","metadata":{"category":"","name":"Natural Light"},"state_schema":{"$ref":"natural_light_state.json#"},"supported_features":[],"trigger_schema":{"$ref":"natural_light_trigger.json#"},"type":"behavior_script","version":"0.0.1"},{"configuration_schema":{"$ref":"config.json#"},"description":"Tap Switch script","id":"f306f634-acdb-4dd6-bdf5-48dd626d667e","metadata":{"category":"accessory","name":"Tap Switch"},"state_schema":{"$ref":"state.json#"},"supported_features":[],"trigger_schema":{},"type":"behavior_script","version":"0.0.1"},{"configuration":{"what":[{"group":{"rid":"e9d97c83-2488-4c58-8ccc-113e4423f199","rtype":"room"},"recall":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"recipe"}}],"when_extended":{"end_at":{"time_point":{"time":{"hour":22,"minute":15},"type":"time"}},"randomization":{"minutes":45},"recurrence_days":["monday","tuesday","wednesday","thursday","friday","saturday"],"start_at":{"time_point":{"time":{"hour":21,"minute":28},"type":"time"}}},"where":[{"group":{"rid":"e9d97c83-2488-4c58-8ccc-113e4423f199","rtype":"room"}}]},"dependees":[],"enabled":false,"id":"06c0f36f-4cf4-45ec-8811-2a3b72347de9","last_error":"","metadata":{"name":"Auto Bedroom"},"script_id":"7238c707-8693-4f19-9095-ccdc1444d228","status":"initializing","type":"behavior_instance"},{"configuration":{"what":[{"group":{"rid":"ddfd3d7c-4795-4774-be9c-9c67b194c5a1","rtype":"room"},"recall":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"recipe"}},{"group":{"rid":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","rtype":"room"},"recall":{"rid":"732ff1d9-76a7-4630-aad0-c8acc499bb0b","rtype":"recipe"}}],"when_extended":{"end_at":{"time_point":{"time":{"hour":20,"minute":30},"type":"time"}},"randomization":{"minutes":15},"recurrence_days":["sunday","monday","tuesday","wednesday","thursday","friday","saturday"],"start_at":{"time_point":{"offset":{"minutes":45},"type":"sunset"}}},"where":[{"group":{"rid":"ddfd3d7c-4795-4774-be9c-9c67b194c5a1","rtype":"room"}},{"group":{"rid":"d8639195-dbe2-41a2-8a53-1d7b3930ae58","rtype":"room"}}]},"dependees":[],"enabled":false,"id":"21d1d095-8426-4f54-ae7d-35fa1ee79ba9","last_error":"","metadata":{"name":"Bottom auto"},"script_id":"7238c707-8693-4f19-9095-ccdc1444d228","status":"initializing","type":"behavior_instance"},{"configuration":{"what":[{"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"},"recall":{"rid":"ab77c76a-945f-4ac8-9664-bb0346e9e367","rtype":"scene"}},{"group":{"rid":"9b7589fa-b68c-4b39-a837-3f0c0ccce73a","rtype":"room"},"recall":{"rid":"15424787-7d8c-4166-bf28-5182270bc281","rtype":"scene"}},{"group":{"rid":"581d7d2d-8cdc-4462-99d4-79182f44b63a","rtype":"room"},"recall":{"rid":"a2d9675a-b4a9-474a-a46c-f2c2d0b73cfa","rtype":"scene"}}],"when_extended":{"end_at":{"time_point":{"time":{"hour":21,"minute":45},"type":"time"}},"randomization":{"minutes":60},"recurrence_days":["sunday","monday","tuesday","wednesday","thursday","friday","saturday"],"start_at":{"time_point":{"time":{"hour":19,"minute":23},"type":"time"}}},"where":[{"group":{"rid":"ce4fed2e-1dfb-4e48-9833-4043523b41c7","rtype":"room"}},{"group":{"rid":"9b7589fa-b68c-4b39-a837-3f0c0ccce73a","rtype":"room"}},{"group":{"rid":"581d7d2d-8cdc-4462-99d4-79182f44b63a","rtype":"room"}}]},"dependees":[],"enabled":false,"id":"45d10182-6620-4bac-89a3-1bd755995cce","last_error":"","metadata":{"name":"Auto Upstairs"},"script_id":"7238c707-8693-4f19-9095-ccdc1444d228","status":"initializing","type":"behavior_instance"},{"id":"6b5f6667-2063-4637-b70e-980c3350a6d3","name":"aiohue_gloiwuspax","type":"geofence_client"},{"id":"a87e0c79-8d8b-4c70-9e1f-e50977f84ca7","is_configured":true,"type":"geolocation"}]}




** All resources (makes emacs lag)
#+begin_src shell :results verbatim
curl --insecure -H 'hue-application-key: MOnR-DdEU4iuryG4BpiZhhB94uNovMMM4eK0ASHU' https://192.168.1.19/clip/v2/resource
#+end_src

#+RESULTS:

#+begin_src shell :results verbatim
curl --insecure -H 'hue-application-key: 345abd2b4d0160e8d5384d837465712e' https://192.168.1.20/clip/v2/resource
#+end_src

#+begin_src js
 {
  "data": [
    {
      "id": "f3ce816f-70b6-6f92-9568-0f6fc942bf86",
      "id_v1": "",
      "metadata": {
        "archetype": "bridge_v2",
        "name": "MQTT2Hue"
      },
      "product_data": {
        "certified": false,
        "hardware_platform_type": null,
        "manufacturer_name": "Signify Netherlands B.V.",
        "model_id": "BSB002",
        "product_archetype": "bridge_v2",
        "product_name": "Philips hue",
        "software_version": "1.53.1953188020"
      },
      "services": [
        {
          "rid": "36759568-69a8-7463-4c80-8c5fd55da168",
          "rtype": "bridge"
        }
      ],
      "type": "device"
    },
    {
      "bridge_id": "9061aefffe218f6d",
      "id": "36759568-69a8-7463-4c80-8c5fd55da168",
      "id_v1": "",
      "owner": {
        "rid": "f3ce816f-70b6-6f92-9568-0f6fc942bf86",
        "rtype": "device"
      },
      "time_zone": {
        "time_zone": "Europe/Stockholm"
      },
      "type": "bridge"
    },
    {
      "id": "604e95fc-4245-f6e6-6bba-7acafad0d551",
      "id_v1": "/light/1",
      "metadata": {
        "archetype": "sultan_bulb",
        "name": "TV Backlight"
      },
      "product_data": {
        "certified": false,
        "hardware_platform_type": null,
        "manufacturer_name": "Philips",
        "model_id": "LCL001",
        "product_archetype": "classic_bulb",
        "product_name": "TV Backlight",
        "software_version": "1.93.11"
      },
      "services": [
        {
          "rid": "67dfc0fd-0c82-be2f-0017-88010bf4769e",
          "rtype": "light"
        }
      ],
      "type": "device"
    },
    {
      "alert": {
        "action_values": [
          "breathe"
        ]
      },
      "color": {
        "gamut": null,
        "gamut_type": null,
        "xy": {
          "x": 0.5267,
          "y": 0.4133
        }
      },
      "color_temperature": {
        "mirek": 500,
        "mirek_schema": {
          "mirek_maximum": 500,
          "mirek_minimum": 150
        },
        "mirek_valid": true
      },
      "dimming": {
        "brightness": 28.346457,
        "min_dim_level": null
      },
      "dynamics": {
        "speed": 0,
        "speed_valid": false,
        "status": "none",
        "status_values": [
          "none"
        ]
      },
      "id": "67dfc0fd-0c82-be2f-0017-88010bf4769e",
      "id_v1": "/light/1",
      "metadata": {
        "archetype": "sultan_bulb",
        "name": "TV Backlight"
      },
      "mode": "normal",
      "on": {
        "on": false
      },
      "owner": {
        "rid": "604e95fc-4245-f6e6-6bba-7acafad0d551",
        "rtype": "device"
      },
      "type": "light"
    },
    {
      "children": [
        {
          "rid": "604e95fc-4245-f6e6-6bba-7acafad0d551",
          "rtype": "device"
        }
      ],
      "id": "4a22c5cd-7eba-c711-c5de-14d59d240001",
      "id_v1": "/groups/1",
      "metadata": {
        "archetype": "living_room",
        "name": "Living Room Upstairs"
      },
      "services": [],
      "type": "room"
    },
    {
      "alert": {
        "action_values": [
          "breathe"
        ]
      },
      "color": {
        "gamut": null,
        "gamut_type": null,
        "xy": {
          "x": 0.5267,
          "y": 0.4133
        }
      },
      "color_temperature": {
        "mirek": 500,
        "mirek_schema": {
          "mirek_maximum": 500,
          "mirek_minimum": 150
        },
        "mirek_valid": true
      },
      "dimming": {
        "brightness": 28.346457,
        "min_dim_level": null
      },
      "dynamics": {
        "speed": 0,
        "speed_valid": false,
        "status": "none",
        "status_values": [
          "none"
        ]
      },
      "id": "4a22c5cd-7eba-c711-c5de-14d59d240001",
      "id_v1": "/group/1",
      "metadata": {
        "archetype": "sultan_bulb",
        "name": "Living Room Upstairs"
      },
      "mode": "normal",
      "on": {
        "on": false
      },
      "owner": {
        "rid": "4a22c5cd-7eba-c711-c5de-14d59d240001",
        "rtype": "room"
      },
      "type": "light"
    },
    {
      "id": "dbbc30a8-384e-4d61-e15e-b8c5bc97be00",
      "is_configured": false,
      "type": "geolocation"
    }
  ],
  "errors": []
}
#+end_src


** Bridge

#+begin_src shell :results verbatim
curl --insecure -H 'hue-application-key: MOnR-DdEU4iuryG4BpiZhhB94uNovMMM4eK0ASHU' https://192.168.1.19/clip/v2/resource/bridge
#+end_src

#+RESULTS[2be9bd87aca06caee1538edc008cb27f6819b38b]:
: {"errors":[],"data":[{"id":"1546cfb2-70a3-4b6c-a233-9ac38c7d4980","id_v1":"","owner":{"rid":"69dc4fd9-01e7-4329-ae0b-476ad339753c","rtype":"device"},"bridge_id":"ecb5fafffe259801","time_zone":{"time_zone":"Europe/Stockholm"},"type":"bridge"}]}


** V1 lights

#+begin_src sh :results verbatim
curl --insecure -X GET 'https://192.168.1.19/api/MOnR-DdEU4iuryG4BpiZhhB94uNovMMM4eK0ASHU/lights'
#+end_src

#+RESULTS[897bc658ee09a332f48c571c0a4c310a02fbcfaf]:
: {"1":{"state":{"on":false,"bri":127,"ct":366,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":true},"swupdate":{"state":"noupdates","lastinstall":"2021-08-17T12:58:07"},"type":"Color temperature light","name":"Hue ambiance lamp 1","modelid":"LTW010","manufacturername":"Signify Netherlands B.V.","productname":"Hue ambiance lamp","capabilities":{"certified":true,"control":{"mindimlevel":1000,"maxlumen":806,"ct":{"min":153,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"sultanbulb","function":"functional","direction":"omnidirectional","startup":{"mode":"safety","configured":true}},"uniqueid":"00:17:88:01:06:16:63:51-0b","swversion":"1.88.1","swconfigid":"5C7DF970","productid":"Philips-LTW010-1-A19CTv2"},"2":{"state":{"on":true,"bri":254,"ct":366,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":false},"swupdate":{"state":"noupdates","lastinstall":"2021-08-17T12:58:02"},"type":"Color temperature light","name":"Hue ambiance lamp 2","modelid":"LTW010","manufacturername":"Signify Netherlands B.V.","productname":"Hue ambiance lamp","capabilities":{"certified":true,"control":{"mindimlevel":1000,"maxlumen":806,"ct":{"min":153,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"sultanbulb","function":"functional","direction":"omnidirectional","startup":{"mode":"safety","configured":true}},"uniqueid":"00:17:88:01:06:ef:2f:32-0b","swversion":"1.88.1","swconfigid":"5C7DF970","productid":"Philips-LTW010-1-A19CTv2"},"3":{"state":{"on":true,"bri":254,"ct":366,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":false},"swupdate":{"state":"noupdates","lastinstall":"2022-08-24T01:44:04"},"type":"Color temperature light","name":"Hue panel Ann","modelid":"3216231P6","manufacturername":"Signify Netherlands B.V.","productname":"Hue Aurelle Panel","capabilities":{"certified":true,"control":{"mindimlevel":100,"maxlumen":4200,"ct":{"min":153,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"ceilingsquare","function":"functional","direction":"downwards","startup":{"mode":"safety","configured":true}},"uniqueid":"00:17:88:01:06:7e:4e:dc-0b","swversion":"1.93.11","swconfigid":"6199F43C","productid":"3241-3127-5861_HC02_PSU05"},"4":{"state":{"on":true,"bri":110,"ct":451,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":true},"swupdate":{"state":"noupdates","lastinstall":"2022-01-20T02:24:12"},"type":"Color temperature light","name":"Hue Aurelle JP","modelid":"3216231P6","manufacturername":"Signify Netherlands B.V.","productname":"Hue Aurelle Panel","capabilities":{"certified":true,"control":{"mindimlevel":100,"maxlumen":4200,"ct":{"min":153,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"ceilingsquare","function":"functional","direction":"downwards","startup":{"mode":"safety","configured":true}},"uniqueid":"00:17:88:01:06:7e:56:04-0b","swversion":"1.93.11","swconfigid":"6199F43C","productid":"3241-3127-5861_HC02_PSU05"},"5":{"state":{"on":false,"bri":254,"ct":250,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":true},"swupdate":{"state":"notupdatable","lastinstall":"2020-08-23T14:56:00"},"type":"Color temperature light","name":"Ikea floalt basement","modelid":"FLOALT panel WS 60x60","manufacturername":"IKEA of Sweden","productname":"Color temperature light","capabilities":{"certified":false,"control":{"ct":{"min":250,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"ceilingsquare","function":"functional","direction":"omnidirectional"},"uniqueid":"ec:1b:bd:ff:fe:8e:d0:0c-01","swversion":"1.2.217"},"6":{"state":{"on":false,"bri":128,"alert":"select","mode":"homeautomation","reachable":true},"swupdate":{"state":"notupdatable","lastinstall":"2021-08-31T16:58:25"},"type":"Dimmable light","name":"In hall wall dimmer living room","modelid":"HK-SL-DIM-A","manufacturername":"Sunricher","productname":"Dimmable light","capabilities":{"certified":false,"control":{},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"doublespot","function":"functional","direction":"omnidirectional"},"uniqueid":"84:fd:27:ff:fe:6a:74:4b-01","swversion":"2.5.3_r50"},"7":{"state":{"on":true,"bri":254,"hue":9216,"sat":187,"effect":"none","xy":[0.4584,0.4100],"ct":366,"alert":"select","colormode":"xy","mode":"homeautomation","reachable":true},"swupdate":{"state":"notupdatable","lastinstall":"2021-09-10T15:45:48"},"type":"Extended color light","name":"Gledopto controller Wardrobe","modelid":"GL-C-008","manufacturername":"GLEDOPTO","productname":"Extended color light","capabilities":{"certified":false,"control":{"colorgamuttype":"other","ct":{"min":155,"max":495}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"ceilinground","function":"mixed","direction":"omnidirectional"},"uniqueid":"00:12:4b:00:23:b2:a6:c6-0b","swversion":"2.0.2"},"8":{"state":{"on":true,"bri":95,"ct":447,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":false},"swupdate":{"state":"notupdatable","lastinstall":"2021-11-11T10:46:10"},"type":"Color temperature light","name":"Innr light in plafond 1","modelid":"RB 278 T","manufacturername":"innr","productname":"Color temperature light","capabilities":{"certified":false,"control":{"ct":{"min":200,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"classicbulb","function":"functional","direction":"omnidirectional"},"uniqueid":"00:15:8d:00:07:38:27:8b-01","swversion":"2.0"},"9":{"state":{"on":true,"bri":95,"ct":447,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":false},"swupdate":{"state":"notupdatable","lastinstall":"2021-11-11T10:52:47"},"type":"Color temperature light","name":"Innr plafond 2","modelid":"RB 278 T","manufacturername":"innr","productname":"Color temperature light","capabilities":{"certified":false,"control":{"ct":{"min":200,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"classicbulb","function":"functional","direction":"omnidirectional"},"uniqueid":"00:15:8d:00:07:36:7d:0c-01","swversion":"2.0"},"10":{"state":{"on":true,"bri":95,"ct":447,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":false},"swupdate":{"state":"notupdatable","lastinstall":"2021-11-11T10:52:49"},"type":"Color temperature light","name":"Innr plafond 3","modelid":"RB 278 T","manufacturername":"innr","productname":"Color temperature light","capabilities":{"certified":false,"control":{"ct":{"min":200,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"classicbulb","function":"functional","direction":"omnidirectional"},"uniqueid":"00:15:8d:00:06:e1:5b:29-01","swversion":"2.0"},"11":{"state":{"on":false,"bri":254,"alert":"select","mode":"homeautomation","reachable":false},"swupdate":{"state":"noupdates","lastinstall":"2022-08-21T01:13:44"},"type":"Dimmable light","name":"Hue filament bulb 1","modelid":"LWA004","manufacturername":"Signify Netherlands B.V.","productname":"Hue filament bulb","capabilities":{"certified":true,"control":{"mindimlevel":2000,"maxlumen":550},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"vintagebulb","function":"decorative","direction":"omnidirectional","startup":{"mode":"safety","configured":true}},"uniqueid":"00:17:88:01:0b:08:ae:37-0b","swversion":"1.93.11","swconfigid":"8C791294","productid":"Philips-LWA004-1-A60CFDLv1"},"12":{"state":{"on":false,"bri":203,"ct":366,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":true},"swupdate":{"state":"notupdatable","lastinstall":"2021-11-14T12:25:53"},"type":"Color temperature light","name":"Innr Color temperature light k","modelid":"RB 278 T","manufacturername":"innr","productname":"Color temperature light","capabilities":{"certified":false,"control":{"ct":{"min":200,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"classicbulb","function":"functional","direction":"omnidirectional"},"uniqueid":"00:15:8d:00:07:36:70:4d-01","swversion":"2.0"},"13":{"state":{"on":false,"bri":128,"alert":"select","mode":"homeautomation","reachable":true},"swupdate":{"state":"noupdates","lastinstall":"2021-11-20T08:57:31"},"type":"Dimmable light","name":"in center wall eat room","modelid":"SM309","manufacturername":"Samotech","productname":"Hue white light","capabilities":{"certified":true,"control":{},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"singlespot","function":"functional","direction":"omnidirectional","startup":{"mode":"powerfail","configured":true}},"uniqueid":"b4:e3:f9:ff:fe:c6:57:db-01","swversion":"2.5.3_r51"},"14":{"state":{"on":true,"bri":254,"alert":"select","mode":"homeautomation","reachable":true},"swupdate":{"state":"notupdatable","lastinstall":"2021-11-29T15:31:41"},"type":"Dimmable light","name":"Bedroom switch in wall","modelid":"HK-SL-DIM-A","manufacturername":"Sunricher","productname":"Dimmable light","capabilities":{"certified":false,"control":{},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"classicbulb","function":"functional","direction":"omnidirectional"},"uniqueid":"90:35:ea:ff:fe:93:05:8f-01","swversion":"2.5.3_r52"},"15":{"state":{"on":true,"bri":254,"ct":344,"alert":"select","colormode":"ct","mode":"homeautomation","reachable":false},"swupdate":{"state":"notupdatable","lastinstall":"2021-12-11T18:32:29"},"type":"Color temperature light","name":"Innr temp mir","modelid":"RB 278 T","manufacturername":"innr","productname":"Color temperature light","capabilities":{"certified":false,"control":{"ct":{"min":200,"max":454}},"streaming":{"renderer":false,"proxy":false}},"config":{"archetype":"classicbulb","function":"functional","direction":"omnidirectional"},"uniqueid":"00:15:8d:00:07:36:6c:78-01","swversion":"2.0"},"17":{"state":{"on":true,"bri":107,"hue":47858,"sat":245,"effect":"none","xy":[0.1825,0.0695],"ct":500,"alert":"select","colormode":"xy","mode":"homeautomation","reachable":true},"swupdate":{"state":"noupdates","lastinstall":"2022-10-15T01:40:06"},"type":"Extended color light","name":"Hue Play 1 JP ","modelid":"440400982842","manufacturername":"Signify Netherlands B.V.","productname":"Hue Play","capabilities":{"certified":true,"control":{"mindimlevel":100,"maxlumen":560,"colorgamuttype":"C","colorgamut":[[0.6915,0.3083],[0.1700,0.7000],[0.1532,0.0475]],"ct":{"min":153,"max":500}},"streaming":{"renderer":true,"proxy":true}},"config":{"archetype":"hueplay","function":"decorative","direction":"upwards","startup":{"mode":"safety","configured":true}},"uniqueid":"00:17:88:01:0b:e6:11:71-0b","swversion":"1.93.11","swconfigid":"684D5496","productid":"3241-3127-7871_HC07_PSG03"}}

** V2 geolocation

#+begin_src shell :results verbatim
curl --insecure -H 'hue-application-key: MOnR-DdEU4iuryG4BpiZhhB94uNovMMM4eK0ASHU' https://192.168.1.19/clip/v2/resource/geolocation
#+end_src

#+RESULTS:
: {"errors":[],"data":[{"id":"a87e0c79-8d8b-4c70-9e1f-e50977f84ca7","is_configured":true,"type":"geolocation"}]}



** V2 lights

#+begin_src shell :results verbatim
curl --insecure -H 'hue-application-key: 592f873489e9cbecad411792fa5f11a4' https://192.168.1.20/clip/v2/resource/light
#+end_src

#+RESULTS:
: {"data":[{"dimming":{"brightness":0.39370078,"min_dim_level":null},"color_temperature":{"mirek":396,"mirek_schema":{"mirek_maximum":500,"mirek_minimum":150},"mirek_valid":true},"color":{"gamut":null,"gamut_type":null,"xy":{"x":0.4752,"y":0.4134}},"id":"67dfc0fd-0c82-be2f-0017-88010bf4769e","id_v1":"/light/1","owner":{"rid":"604e95fc-4245-f6e6-6bba-7acafad0d551","rtype":"device"},"metadata":{"archetype":"sultan_bulb","name":"TV Backlight"},"on":{"on":false},"dynamics":{"speed":0,"speed_valid":false,"status":"none","status_values":["none"]},"alert":{"action_values":["breathe"]},"mode":"normal","type":"light"},{"dimming":{"brightness":0.39370078,"min_dim_level":null},"color_temperature":{"mirek":396,"mirek_schema":{"mirek_maximum":500,"mirek_minimum":150},"mirek_valid":true},"color":{"gamut":null,"gamut_type":null,"xy":{"x":0.4752,"y":0.4134}},"id":"4a22c5cd-7eba-c711-c5de-14d59d240001","id_v1":"/groups/1","owner":{"rid":"702e1043-68c5-7c03-c3ab-3ecdb02a3b8d","rtype":"room"},"metadata":{"archetype":"sultan_bulb","name":"Living Room Upstairs"},"on":{"on":false},"dynamics":{"speed":0,"speed_valid":false,"status":"none","status_values":["none"]},"alert":{"action_values":["breathe"]},"mode":"normal","type":"light"},{"dimming":{"brightness":0.39370078,"min_dim_level":null},"color_temperature":{"mirek":396,"mirek_schema":{"mirek_maximum":500,"mirek_minimum":150},"mirek_valid":true},"color":{"gamut":null,"gamut_type":null,"xy":{"x":0.4752,"y":0.4134}},"id":"bf911f2b-583c-b693-0d12-9be05eea0000","id_v1":"/groups/0","owner":{"rid":"6ad65062-0be7-1187-ac85-0f4093d76f54","rtype":"bridge_home"},"metadata":{"archetype":"sultan_bulb","name":"# Home group #"},"on":{"on":false},"dynamics":{"speed":0,"speed_valid":false,"status":"none","status_values":["none"]},"alert":{"action_values":["breathe"]},"mode":"normal","type":"light"}],"errors":[]}


** V2 devices

#+begin_src shell :results verbatim
curl --insecure -H 'hue-application-key: 592f873489e9cbecad411792fa5f11a4' https://192.168.1.20/clip/v2/resource
#+end_src

#+begin_src js
 {
  "data": [
    {
      "id": "f3ce816f-70b6-6f92-9568-0f6fc942bf86",
      "id_v1": "",
      "metadata": {
        "archetype": "bridge_v2",
        "name": "MQTT2Hue"
      },
      "product_data": {
        "certified": false,
        "hardware_platform_type": null,
        "manufacturer_name": "Signify Netherlands B.V.",
        "model_id": "BSB002",
        "product_archetype": "bridge_v2",
        "product_name": "Philips hue",
        "software_version": "1.53.1953188020"
      },
      "services": [
        {
          "rid": "36759568-69a8-7463-4c80-8c5fd55da168",
          "rtype": "bridge"
        }
      ],
      "type": "device"
    },
    {
      "bridge_id": "9061aefffe218f6d",
      "id": "36759568-69a8-7463-4c80-8c5fd55da168",
      "id_v1": "",
      "owner": {
        "rid": "f3ce816f-70b6-6f92-9568-0f6fc942bf86",
        "rtype": "device"
      },
      "time_zone": {
        "time_zone": "Europe/Stockholm"
      },
      "type": "bridge"
    },
    {
      "id": "604e95fc-4245-f6e6-6bba-7acafad0d551",
      "id_v1": "/light/1",
      "metadata": {
        "archetype": "sultan_bulb",
        "name": "TV Backlight"
      },
      "product_data": {
        "certified": false,
        "hardware_platform_type": null,
        "manufacturer_name": "Philips",
        "model_id": "LCL001",
        "product_archetype": "classic_bulb",
        "product_name": "TV Backlight",
        "software_version": "1.93.11"
      },
      "services": [
        {
          "rid": "67dfc0fd-0c82-be2f-0017-88010bf4769e",
          "rtype": "light"
        }
      ],
      "type": "device"
    },
    {
      "alert": {
        "action_values": [
          "breathe"
        ]
      },
      "color": {
        "gamut": null,
        "gamut_type": null,
        "xy": {
          "x": 0.4752,
          "y": 0.4134
        }
      },
      "color_temperature": {
        "mirek": 396,
        "mirek_schema": {
          "mirek_maximum": 500,
          "mirek_minimum": 150
        },
        "mirek_valid": true
      },
      "dimming": {
        "brightness": 0.39370078,
        "min_dim_level": null
      },
      "dynamics": {
        "speed": 0,
        "speed_valid": false,
        "status": "none",
        "status_values": [
          "none"
        ]
      },
      "id": "67dfc0fd-0c82-be2f-0017-88010bf4769e",
      "id_v1": "/light/1",
      "metadata": {
        "archetype": "sultan_bulb",
        "name": "TV Backlight"
      },
      "mode": "normal",
      "on": {
        "on": false
      },
      "owner": {
        "rid": "604e95fc-4245-f6e6-6bba-7acafad0d551",
        "rtype": "device"
      },
      "type": "light"
    },
    {
      "children": [
        {
          "rid": "604e95fc-4245-f6e6-6bba-7acafad0d551",
          "rtype": "device"
        }
      ],
      "id": "702e1043-68c5-7c03-c3ab-3ecdb02a3b8d",
      "id_v1": "/groups/1",
      "metadata": {
        "archetype": "living_room",
        "name": "Living Room Upstairs"
      },
      "services": [
        {
          "rid": "4a22c5cd-7eba-c711-c5de-14d59d240001",
          "rtype": "grouped_light"
        }
      ],
      "type": "room"
    },
    {
      "alert": {
        "action_values": [
          "breathe"
        ]
      },
      "color": {
        "gamut": null,
        "gamut_type": null,
        "xy": {
          "x": 0.4752,
          "y": 0.4134
        }
      },
      "color_temperature": {
        "mirek": 396,
        "mirek_schema": {
          "mirek_maximum": 500,
          "mirek_minimum": 150
        },
        "mirek_valid": true
      },
      "dimming": {
        "brightness": 0.39370078,
        "min_dim_level": null
      },
      "dynamics": {
        "speed": 0,
        "speed_valid": false,
        "status": "none",
        "status_values": [
          "none"
        ]
      },
      "id": "4a22c5cd-7eba-c711-c5de-14d59d240001",
      "id_v1": "/groups/1",
      "metadata": {
        "archetype": "sultan_bulb",
        "name": "Living Room Upstairs"
      },
      "mode": "normal",
      "on": {
        "on": false
      },
      "owner": {
        "rid": "702e1043-68c5-7c03-c3ab-3ecdb02a3b8d",
        "rtype": "room"
      },
      "type": "light"
    },
    {
      "id": "dbbc30a8-384e-4d61-e15e-b8c5bc97be00",
      "is_configured": false,
      "type": "geolocation"
    },
    {
      "children": [
        {
          "rid": "604e95fc-4245-f6e6-6bba-7acafad0d551",
          "rtype": "device"
        }
      ],
      "id": "6ad65062-0be7-1187-ac85-0f4093d76f54",
      "id_v1": "/groups/0",
      "services": [
        {
          "rid": "bf911f2b-583c-b693-0d12-9be05eea0000",
          "rtype": "grouped_light"
        }
      ],
      "type": "bridge_home"
    },
    {
      "alert": {
        "action_values": [
          "breathe"
        ]
      },
      "color": {
        "gamut": null,
        "gamut_type": null,
        "xy": {
          "x": 0.4752,
          "y": 0.4134
        }
      },
      "color_temperature": {
        "mirek": 396,
        "mirek_schema": {
          "mirek_maximum": 500,
          "mirek_minimum": 150
        },
        "mirek_valid": true
      },
      "dimming": {
        "brightness": 0.39370078,
        "min_dim_level": null
      },
      "dynamics": {
        "speed": 0,
        "speed_valid": false,
        "status": "none",
        "status_values": [
          "none"
        ]
      },
      "id": "bf911f2b-583c-b693-0d12-9be05eea0000",
      "id_v1": "/groups/0",
      "metadata": {
        "archetype": "sultan_bulb",
        "name": "# Home group #"
      },
      "mode": "normal",
      "on": {
        "on": false
      },
      "owner": {
        "rid": "6ad65062-0be7-1187-ac85-0f4093d76f54",
        "rtype": "bridge_home"
      },
      "type": "light"
    }
  ],
  "errors": []
}
#+end_src
